orgs/My-Emacs-Configuration-2026.org
#+title: 我的emacs配置介绍-2026版
#+date: Thu Apr  2 09:57:55 2026
#+author: Zi Liang
#+email: zi1415926.liang@connect.polyu.hk
#+latex_class: elegantpaper
#+filetags: ::

A comprehensive, modular Emacs configuration with AI/LLM integration, Python development tools, Org-mode for notes and publishing, and Vim-style editing via Evil mode.

* Installation & Setup
** Prerequisites

- *Emacs* 27+ recommended
- *Git* for version control features
- *Python* (anaconda3 or miniconda3 recommended) for Python development
- *PlantUML* (~/.emacs.d/software/plantuml.jar) for diagram generation
- *RIPGrep* (rg) for counsel-rg search
- *Universal Ctags* for Citre code navigation

** Installation

#+BEGIN_SRC bash
# Clone the configuration
git clone https://github.com/ziLiang3845/.emacs.d.git ~/.emacs.d

# Install required external tools
# - plantuml.jar (~/.emacs.d/software/plantuml.jar)
# - rg (ripgrep)
# - curl (for OpenRouter API)

# Set environment variables (see Environment Variables section)
export OPENROUTER_API_KEY="your-api-key"

# Launch Emacs
emacs
#+END_SRC

** First-Time Setup

1. Launch Emacs - packages will be automatically installed
2. Wait for all packages to install (first launch may take 5-10 minutes)
3. Restart Emacs when complete

** Setup Scripts (doc/)

The =doc/= directory contains shell scripts to automate the installation of system dependencies. Run these scripts in order before launching Emacs for the first time.

