docs/My-Emacs-Configuration-2026.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-07 Tue 20:50 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的emacs配置介绍-2026版</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/about.html" class="button">About</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">我的emacs配置介绍-2026版</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org167206b">1. Installation &amp; Setup</a>
<ul>
<li><a href="#org0b8be13">1.1. Prerequisites</a></li>
<li><a href="#org2e96166">1.2. Installation</a></li>
<li><a href="#orga62b2c2">1.3. First-Time Setup</a></li>
<li><a href="#org3a11e21">1.4. Setup Scripts (doc/)</a>
<ul>
<li><a href="#org4c9fc8f">1.4.1. Ubuntu/Debian Setup Scripts</a></li>
<li><a href="#orgf31fc15">1.4.2. Recommended Installation Order</a></li>
<li><a href="#org22e64c7">1.4.3. Arch Linux</a></li>
<li><a href="#org1415d4b">1.4.4. Other Setup Files</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeb9df11">2. Project Structure</a>
<ul>
<li><a href="#org9bf182c">2.1. Module Loading Order (init.el)</a></li>
</ul>
</li>
<li><a href="#orga16af4e">3. Core Features Overview</a></li>
<li><a href="#org3a2f770">4. Keybindings Reference</a>
<ul>
<li><a href="#org581e8c5">4.1. Global Keybindings</a></li>
<li><a href="#org9112e2b">4.2. Evil Mode Leader Key (SPC)</a>
<ul>
<li><a href="#org3b41103">4.2.1. File &amp; Buffer Management</a></li>
<li><a href="#orge528fe4">4.2.2. Window Management</a></li>
<li><a href="#org28569d5">4.2.3. Help &amp; Documentation</a></li>
<li><a href="#org64e75e4">4.2.4. Code Navigation &amp; Editing</a></li>
<li><a href="#org3daff5e">4.2.5. Citre Code Navigation</a></li>
<li><a href="#org2ea7c88">4.2.6. Anaconda Mode (Python)</a></li>
<li><a href="#org667760b">4.2.7. Python Scripts (F5 / nohup)</a></li>
<li><a href="#orgd0b4c24">4.2.8. SSH Connections</a></li>
<li><a href="#org79ee955">4.2.9. Clipboard &amp; WSL</a></li>
<li><a href="#org76fe390">4.2.10. Shell</a></li>
<li><a href="#org3f5f8d0">4.2.11. English &amp; Spell</a></li>
<li><a href="#org6d7e855">4.2.12. Org Mode</a></li>
<li><a href="#org8cbfba5">4.2.13. Hide/Show Code</a></li>
<li><a href="#org0c1eda8">4.2.14. Collections</a></li>
</ul>
</li>
<li><a href="#org7b74c69">4.3. Evil State Navigation</a></li>
<li><a href="#orgeb42b0d">4.4. Evil Escape</a></li>
<li><a href="#orgcadceec">4.5. Window Navigation (winum)</a></li>
<li><a href="#org5f02f34">4.6. Ivy/Counsel Search</a></li>
<li><a href="#orgf2de5b7">4.7. Org Mode Keybindings</a></li>
<li><a href="#org4dff0d6">4.8. Python Development</a></li>
<li><a href="#orgd77cff6">4.9. Citre Code Navigation</a></li>
<li><a href="#org2d7a03c">4.10. AI/LLM Keybindings</a></li>
<li><a href="#org26f8880">4.11. UI Scaling</a></li>
<li><a href="#org80d4c74">4.12. Flymake Diagnostics</a></li>
</ul>
</li>
<li><a href="#orgc415343">5. Package List</a>
<ul>
<li><a href="#org6261ec2">5.1. Core Infrastructure</a></li>
<li><a href="#org365ddf8">5.2. Vim Emulation (Evil)</a></li>
<li><a href="#org8b55638">5.3. UI &amp; Themes</a></li>
<li><a href="#org5aad5df">5.4. Python Development</a></li>
<li><a href="#org263ce3d">5.5. Language Server Protocol</a></li>
<li><a href="#org627b55b">5.6. Code Navigation</a></li>
<li><a href="#org69740b7">5.7. Org Mode</a></li>
<li><a href="#org99631a4">5.8. Snippets &amp; Templates</a></li>
<li><a href="#org733064a">5.9. AI/LLM Integration</a></li>
<li><a href="#org10ca13f">5.10. Shell &amp; Terminal</a></li>
<li><a href="#orgf8ac0b2">5.11. Version Control</a></li>
<li><a href="#org7229133">5.12. Web Development</a></li>
<li><a href="#orgfaf72cb">5.13. Other Languages</a></li>
<li><a href="#orgdb1690e">5.14. Productivity</a></li>
<li><a href="#org83263c5">5.15. Utilities</a></li>
</ul>
</li>
<li><a href="#orgd72eef7">6. Configuration Files</a>
<ul>
<li><a href="#orgc43b1e3">6.1. init-ai.el - AI/LLM Integration</a></li>
<li><a href="#org6728afa">6.2. init-openai.el - Aider (DeepSeek)</a></li>
<li><a href="#orgc988516">6.3. init-lsp.el - Language Server Protocol</a></li>
<li><a href="#org06f6009">6.4. init-org.el - Org Mode</a></li>
<li><a href="#orga460230">6.5. init-evil.el - Vim Emulation</a></li>
<li><a href="#org2f763e9">6.6. init-ui.el - Visual Configuration</a></li>
<li><a href="#org27f0059">6.7. init-python.el - Python Development</a></li>
<li><a href="#orgf9b19e4">6.8. init-ssh.el - SSH Connections</a></li>
</ul>
</li>
<li><a href="#org5f3cf81">7. Custom Functions</a>
<ul>
<li><a href="#orgd55fbfd">7.1. Core Utilities (init-self-config-function.el)</a></li>
<li><a href="#orgb86ac3d">7.2. Python Scripts (init-python.el)</a></li>
<li><a href="#orgb275cd0">7.3. Buffer Management (init-buffer.el)</a></li>
<li><a href="#org7b8c498">7.4. WSL Utilities (init-wsl.el)</a></li>
<li><a href="#org0bc515d">7.5. SSH Connections (init-ssh.el)</a></li>
<li><a href="#orgef40441">7.6. Org Mode (init-org.el)</a></li>
<li><a href="#org0259072">7.7. Blog Publishing (init-blog.el)</a></li>
<li><a href="#org36f5221">7.8. LaTeX (init-latex.el)</a></li>
</ul>
</li>
<li><a href="#org0da2ad9">8. Platform-Specific Features</a>
<ul>
<li><a href="#org0f02d5c">8.1. Windows (WSL)</a></li>
<li><a href="#org8132ccb">8.2. macOS</a></li>
<li><a href="#orgd612742">8.3. Linux</a></li>
<li><a href="#org4dcfef2">8.4. WSL (Windows Subsystem for Linux)</a></li>
</ul>
</li>
<li><a href="#org170102b">9. Environment Variables</a></li>
<li><a href="#orgb390c9c">10. Custom Themes &amp; Colors</a>
<ul>
<li><a href="#org9f67f14">10.1. doom-dracula Theme</a></li>
<li><a href="#org412c5b5">10.2. Font Configuration</a></li>
</ul>
</li>
<li><a href="#org674f5ce">11. Troubleshooting</a>
<ul>
<li><a href="#org35d7955">11.1. Package Installation Fails</a></li>
<li><a href="#org7e03761">11.2. LSP Not Working</a></li>
<li><a href="#org9dfa182">11.3. AI Features Not Working</a></li>
<li><a href="#org3b26dc6">11.4. SSH Connection Issues</a></li>
<li><a href="#orgbd8dbd0">11.5. Performance Issues</a></li>
</ul>
</li>
<li><a href="#org3659e2c">12. Acknowledgments</a></li>
<li><a href="#org902d0c7">13. 中文翻译</a>
<ul>
<li><a href="#org4e73e30">13.1. 安装与设置</a>
<ul>
<li><a href="#orgf91a1bf">13.1.1. 前置要求</a></li>
<li><a href="#org83426b3">13.1.2. 安装</a></li>
<li><a href="#orgbffb936">13.1.3. 首次设置</a></li>
<li><a href="#org044ae06">13.1.4. 设置脚本 (doc/)</a></li>
</ul>
</li>
<li><a href="#org6dc9f63">13.2. 项目结构</a>
<ul>
<li><a href="#orge77a6a1">13.2.1. 模块加载顺序 (init.el)</a></li>
</ul>
</li>
<li><a href="#org6a3f7dc">13.3. 核心功能概览</a></li>
<li><a href="#orgdcaab48">13.4. 快捷键参考</a>
<ul>
<li><a href="#org6d77e3a">13.4.1. 全局快捷键</a></li>
<li><a href="#orge83c9dd">13.4.2. Evil 模式 Leader 键 (SPC)</a></li>
<li><a href="#org32f91f8">13.4.3. Evil 状态导航</a></li>
<li><a href="#org0caeb35">13.4.4. Evil 转义</a></li>
<li><a href="#org9893ae5">13.4.5. 窗口导航 (winum)</a></li>
<li><a href="#orgb5f99c4">13.4.6. Ivy/Counsel 搜索</a></li>
<li><a href="#org5bd5325">13.4.7. Org 模式快捷键</a></li>
<li><a href="#org10588d4">13.4.8. Python 开发</a></li>
<li><a href="#orgc3a31e7">13.4.9. Citre 代码导航</a></li>
<li><a href="#orgf1765cc">13.4.10. AI/LLM 快捷键</a></li>
<li><a href="#org9f7dba2">13.4.11. UI 缩放</a></li>
<li><a href="#org3984993">13.4.12. Flymake 诊断</a></li>
</ul>
</li>
<li><a href="#org950c574">13.5. 包列表</a>
<ul>
<li><a href="#org758ffa5">13.5.1. 核心基础设施</a></li>
<li><a href="#org0d39708">13.5.2. Vim 模拟 (Evil)</a></li>
<li><a href="#org0a3aad4">13.5.3. UI 和主题</a></li>
<li><a href="#orga1b1e83">13.5.4. Python 开发</a></li>
<li><a href="#org1a91c83">13.5.5. 语言服务器协议</a></li>
<li><a href="#orge51dc9c">13.5.6. 代码导航</a></li>
<li><a href="#org4107f0e">13.5.7. Org Mode</a></li>
<li><a href="#orgc72fa28">13.5.8. 代码片段和模板</a></li>
<li><a href="#org5458451">13.5.9. AI/LLM 集成</a></li>
<li><a href="#orgc3e78ce">13.5.10. Shell 和终端</a></li>
<li><a href="#org60dcd60">13.5.11. 版本控制</a></li>
<li><a href="#orgf17be28">13.5.12. Web 开发</a></li>
<li><a href="#orga9d423f">13.5.13. 其他语言</a></li>
<li><a href="#org0b00025">13.5.14. 生产力工具</a></li>
<li><a href="#org23ab203">13.5.15. 实用工具</a></li>
</ul>
</li>
<li><a href="#orgee5f940">13.6. 配置文件</a>
<ul>
<li><a href="#orga3ba2e1">13.6.1. init-ai.el - AI/LLM 集成</a></li>
<li><a href="#orgc99e9b2">13.6.2. init-openai.el - Aider (DeepSeek)</a></li>
<li><a href="#org04b5a66">13.6.3. init-lsp.el - 语言服务器协议</a></li>
<li><a href="#org6f272ff">13.6.4. init-org.el - Org Mode</a></li>
<li><a href="#orga6bc8cd">13.6.5. init-evil.el - Vim 模拟</a></li>
<li><a href="#org32fa66b">13.6.6. init-ui.el - 视觉配置</a></li>
<li><a href="#orgc97f0b6">13.6.7. init-python.el - Python 开发</a></li>
<li><a href="#org9ab00d1">13.6.8. init-ssh.el - SSH 连接</a></li>
</ul>
</li>
<li><a href="#org8c1b4ca">13.7. 自定义函数</a>
<ul>
<li><a href="#org296b7bd">13.7.1. 核心工具 (init-self-config-function.el)</a></li>
<li><a href="#org3efed11">13.7.2. Python 脚本 (init-python.el)</a></li>
<li><a href="#org266046d">13.7.3. 缓冲区管理 (init-buffer.el)</a></li>
<li><a href="#org4b78d44">13.7.4. WSL 工具 (init-wsl.el)</a></li>
<li><a href="#org08525e9">13.7.5. SSH 连接 (init-ssh.el)</a></li>
<li><a href="#org24fc649">13.7.6. Org 模式 (init-org.el)</a></li>
<li><a href="#orgddfa3e5">13.7.7. 博客发布 (init-blog.el)</a></li>
<li><a href="#org933b8dd">13.7.8. LaTeX (init-latex.el)</a></li>
</ul>
</li>
<li><a href="#org79bd23d">13.8. 平台特定功能</a>
<ul>
<li><a href="#org66eecf7">13.8.1. Windows (WSL)</a></li>
<li><a href="#org782f1a4">13.8.2. macOS</a></li>
<li><a href="#org52e597b">13.8.3. Linux</a></li>
<li><a href="#orge702887">13.8.4. WSL (Windows Subsystem for Linux)</a></li>
</ul>
</li>
<li><a href="#org9468ac0">13.9. 环境变量</a></li>
<li><a href="#org1b34fba">13.10. 自定义主题和颜色</a>
<ul>
<li><a href="#orgd0ac9c1">13.10.1. doom-dracula 主题</a></li>
<li><a href="#orgc6ca9be">13.10.2. 字体配置</a></li>
</ul>
</li>
<li><a href="#org7de405d">13.11. 故障排除</a>
<ul>
<li><a href="#orgb3d8ecf">13.11.1. 包安装失败</a></li>
<li><a href="#orgc41056d">13.11.2. LSP 不工作</a></li>
<li><a href="#org6e5ad89">13.11.3. AI 功能不工作</a></li>
<li><a href="#org7a44b4f">13.11.4. SSH 连接问题</a></li>
<li><a href="#orgd2ca1ba">13.11.5. 性能问题</a></li>
</ul>
</li>
<li><a href="#orgd1c2da3">13.12. 致谢</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
A comprehensive, modular Emacs configuration with AI/LLM integration, Python development tools, Org-mode for notes and publishing, and Vim-style editing via Evil mode.
</p>
<div id="outline-container-org167206b" class="outline-2">
<h2 id="org167206b"><span class="section-number-2">1.</span> Installation &amp; Setup</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0b8be13" class="outline-3">
<h3 id="org0b8be13"><span class="section-number-3">1.1.</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b>Emacs</b> 27+ recommended</li>
<li><b>Git</b> for version control features</li>
<li><b>Python</b> (anaconda3 or miniconda3 recommended) for Python development</li>
<li><b>PlantUML</b> (~/.emacs.d/software/plantuml.jar) for diagram generation</li>
<li><b>RIPGrep</b> (rg) for counsel-rg search</li>
<li><b>Universal Ctags</b> for Citre code navigation</li>
</ul>
</div>
</div>
<div id="outline-container-org2e96166" class="outline-3">
<h3 id="org2e96166"><span class="section-number-3">1.2.</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Clone the configuration
</span>git clone https://github.com/ziLiang3845/.emacs.d.git ~/.emacs.d

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Install required external tools
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- plantuml.jar (~/.emacs.d/software/plantuml.jar)
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- rg (ripgrep)
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- curl (for OpenRouter API)
</span>
<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Set environment variables (see Environment Variables section)
</span><span style="color: #30b3ff;">export</span> <span style="color: #62ff94;">OPENROUTER_API_KEY</span>=<span style="color: #1cc24b;">"your-api-key"</span>

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Launch Emacs
</span>emacs
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga62b2c2" class="outline-3">
<h3 id="orga62b2c2"><span class="section-number-3">1.3.</span> First-Time Setup</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Launch Emacs - packages will be automatically installed</li>
<li>Wait for all packages to install (first launch may take 5-10 minutes)</li>
<li>Restart Emacs when complete</li>
</ol>
</div>
</div>
<div id="outline-container-org3a11e21" class="outline-3">
<h3 id="org3a11e21"><span class="section-number-3">1.4.</span> Setup Scripts (doc/)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The <code>doc/</code> directory contains shell scripts to automate the installation of system dependencies. Run these scripts in order before launching Emacs for the first time.
</p>
</div>
