orgs/My-Emacs-Configuration-2026.org
*** Ubuntu/Debian Setup Scripts

| Script                      | Description                                                                                              |
|-----------------------------|----------------------------------------------------------------------------------------------------------|
| =0.make_install_emacs29.sh=   | Compile and install Emacs 30.1 from source (requires build tools)                                        |
| =2.run_ubuntu_shell_sudo.sh=  | Install system packages: xclip, xsel, gdb, w3m, aspell, scrot, openjdk-17, graphviz, python3, pipenv, mplayer, socat, cmake, zsh, ripgrep, ag, and development libraries |
| =3.gitclone.sh=              | Clone additional repositories (for optional features)                                                     |
| =4.pip-install.sh=          | Install Python packages: python-lsp-server, torch, numpy, scikit-learn, matplotlib                      |
| =5.add_fonts.sh=            | Install Maple Mono and CJK fonts (WenKai)                                                                |
| =6.initial_setup.sh=        | Configure git user.name and user.email globally                                                          |
| =install-ctags.sh=         | Install universal-ctags for Citre code navigation                                                       |

*** Recommended Installation Order

#+BEGIN_SRC bash
cd ~/.emacs.d/doc/

# 1. Install system packages (Ubuntu/Debian)
sudo bash 2.run_ubuntu_shell_sudo.sh

# 2. Install Emacs from source (if not using package manager)
bash 0.make_install_emacs29.sh

# 3. Install ctags for code navigation
sudo bash install-ctags.sh

# 4. Install fonts
bash 5.add_fonts.sh

# 5. Install Python packages for LSP
bash 4.pip-install.sh

# 6. Git configuration
bash 6.initial_setup.sh
#+END_SRC

*** Arch Linux

| Script                           | Description                           |
|----------------------------------|---------------------------------------|
| =2.1.run_install_arch_pacman.sh=  | Install packages via pacman           |
| =5.1.add_fonts_arch_pacman.sh=   | Install fonts on Arch                 |

*** Other Setup Files

| File                               | Description                                      |
|------------------------------------|--------------------------------------------------|
| =hope.org=                          | TODO tracking and wishlist                      |
| =howToGetCapture.org=               | Screen capture setup guide                       |
| =spellcheck.org=                    | Spell checking configuration                     |
| =WSL2-ubuntu-install-config-emacs.org= | WSL2-specific Emacs installation guide       |
| =install_emacs_without_sudo.txt=   | Notes on building Emacs without sudo            |
| =latex环境指南.doc=                  | LaTeX environment setup guide (Chinese)          |

* Project Structure

#+BEGIN_EXAMPLE
.emacs.d/
├── init.el                    # Main entry point
├── lisp/
│   ├── init-*.el            # Feature modules (~50 files)
│   ├── custom.el            # Emacs Customize settings
│   ├── my-*.el              # Custom helpers
│   └── org-*.el             # Org-mode extensions
├── doc/                      # Setup scripts for system dependencies
├── other-files/              # Additional resources
└── feeds/                    # RSS feed configuration (elfeed)
#+END_EXAMPLE

** Module Loading Order (init.el)

- init-self-config-function  → Platform detection, core utilities
- init-wsl                   → WSL utilities
- init-elpa                  → Package management
- init-openai               → Aider (DeepSeek AI coding assistant)
- init-eshell               → Shell configuration
- init-proxy                → Proxy settings
- init-largefile            → Large file handling
- init-dired                → File manager
- init-clipboard            → Clipboard integration
- init-yas                  → Snippets
- init-git                  → Git gutter
- init-citre                → Tags-based code navigation
- init-python               → Python development
- init-latex                → LaTeX editing
- init-cl                   → Common Lisp
- init-cpp                  → C++ (disabled)
- init-rust                 → Rust development
- init-cider                → Clojure REPL
- init-blog                 → Org publishing
- init-web                  → Web development
- init-path                 → PATH configuration
- init-rss                  → RSS reader (elfeed)
- init-keybindings          → Global keybindings
- init-rg                   → Ripgrep integration
- init-spell                → Spell checking
- init-packages             → Package initialization
- init-lsp                  → Language Server Protocol
- init-evil                 → Vim emulation
- init-undo                 → Undo configuration
- init-keyfreq              → Key frequency tracking
- init-org                  → Org-mode configuration
- init-ssh                  → SSH connections
- init-ai                   → AI/LLM integration (gptel, claude-code-ide)
- init-modeline             → Mode line configuration
- init-window               → Window management (winum)
- init-chinese              → Chinese font support
- init-better-defaults      → Improved defaults
- init-ui                   → Visual theme and styling
- org-ui.el                 → Org-specific UI

