docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org4c9fc8f" class="outline-4">
<h4 id="org4c9fc8f"><span class="section-number-4">1.4.1.</span> Ubuntu/Debian Setup Scripts</h4>
<div class="outline-text-4" id="text-1-4-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Script</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>0.make_install_emacs29.sh</code></td>
<td class="org-left">Compile and install Emacs 30.1 from source (requires build tools)</td>
</tr>

<tr>
<td class="org-left"><code>2.run_ubuntu_shell_sudo.sh</code></td>
<td class="org-left">Install system packages: xclip, xsel, gdb, w3m, aspell, scrot, openjdk-17, graphviz, python3, pipenv, mplayer, socat, cmake, zsh, ripgrep, ag, and development libraries</td>
</tr>

<tr>
<td class="org-left"><code>3.gitclone.sh</code></td>
<td class="org-left">Clone additional repositories (for optional features)</td>
</tr>

<tr>
<td class="org-left"><code>4.pip-install.sh</code></td>
<td class="org-left">Install Python packages: python-lsp-server, torch, numpy, scikit-learn, matplotlib</td>
</tr>

<tr>
<td class="org-left"><code>5.add_fonts.sh</code></td>
<td class="org-left">Install Maple Mono and CJK fonts (WenKai)</td>
</tr>

<tr>
<td class="org-left"><code>6.initial_setup.sh</code></td>
<td class="org-left">Configure git user.name and user.email globally</td>
</tr>

<tr>
<td class="org-left"><code>install-ctags.sh</code></td>
<td class="org-left">Install universal-ctags for Citre code navigation</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf31fc15" class="outline-4">
<h4 id="orgf31fc15"><span class="section-number-4">1.4.2.</span> Recommended Installation Order</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #30b3ff;">cd</span> ~/.emacs.d/doc/

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">1. Install system packages (Ubuntu/Debian)
</span>sudo bash 2.run_ubuntu_shell_sudo.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">2. Install Emacs from source (if not using package manager)
</span>bash 0.make_install_emacs29.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">3. Install ctags for code navigation
</span>sudo bash install-ctags.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">4. Install fonts
</span>bash 5.add_fonts.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">5. Install Python packages for LSP
</span>bash 4.pip-install.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">6. Git configuration
</span>bash 6.initial_setup.sh
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org22e64c7" class="outline-4">
<h4 id="org22e64c7"><span class="section-number-4">1.4.3.</span> Arch Linux</h4>
<div class="outline-text-4" id="text-1-4-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Script</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>2.1.run_install_arch_pacman.sh</code></td>
<td class="org-left">Install packages via pacman</td>
</tr>

<tr>
<td class="org-left"><code>5.1.add_fonts_arch_pacman.sh</code></td>
<td class="org-left">Install fonts on Arch</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1415d4b" class="outline-4">
<h4 id="org1415d4b"><span class="section-number-4">1.4.4.</span> Other Setup Files</h4>
<div class="outline-text-4" id="text-1-4-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>hope.org</code></td>
<td class="org-left">TODO tracking and wishlist</td>
</tr>

<tr>
<td class="org-left"><code>howToGetCapture.org</code></td>
<td class="org-left">Screen capture setup guide</td>
</tr>

<tr>
<td class="org-left"><code>spellcheck.org</code></td>
<td class="org-left">Spell checking configuration</td>
</tr>

<tr>
<td class="org-left"><code>WSL2-ubuntu-install-config-emacs.org</code></td>
<td class="org-left">WSL2-specific Emacs installation guide</td>
</tr>

<tr>
<td class="org-left"><code>install_emacs_without_sudo.txt</code></td>
<td class="org-left">Notes on building Emacs without sudo</td>
</tr>

<tr>
<td class="org-left"><code>latex环境指南.doc</code></td>
<td class="org-left">LaTeX environment setup guide (Chinese)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeb9df11" class="outline-2">
<h2 id="orgeb9df11"><span class="section-number-2">2.</span> Project Structure</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org3656b66">
.emacs.d/
├── init.el                    # Main entry point
├── lisp/
│   ├── init-*.el            # Feature modules (~50 files)
│   ├── custom.el            # Emacs Customize settings
│   ├── my-*.el              # Custom helpers
│   └── org-*.el             # Org-mode extensions
├── doc/                      # Setup scripts for system dependencies
├── other-files/              # Additional resources
└── feeds/                    # RSS feed configuration (elfeed)
</pre>
</div>
<div id="outline-container-org9bf182c" class="outline-3">
<h3 id="org9bf182c"><span class="section-number-3">2.1.</span> Module Loading Order (init.el)</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>init-self-config-function  → Platform detection, core utilities</li>
<li>init-wsl                   → WSL utilities</li>
<li>init-elpa                  → Package management</li>
<li>init-openai               → Aider (DeepSeek AI coding assistant)</li>
<li>init-eshell               → Shell configuration</li>
<li>init-proxy                → Proxy settings</li>
<li>init-largefile            → Large file handling</li>
<li>init-dired                → File manager</li>
<li>init-clipboard            → Clipboard integration</li>
<li>init-yas                  → Snippets</li>
<li>init-git                  → Git gutter</li>
<li>init-citre                → Tags-based code navigation</li>
<li>init-python               → Python development</li>
<li>init-latex                → LaTeX editing</li>
<li>init-cl                   → Common Lisp</li>
<li>init-cpp                  → C++ (disabled)</li>
<li>init-rust                 → Rust development</li>
<li>init-cider                → Clojure REPL</li>
<li>init-blog                 → Org publishing</li>
<li>init-web                  → Web development</li>
<li>init-path                 → PATH configuration</li>
<li>init-rss                  → RSS reader (elfeed)</li>
<li>init-keybindings          → Global keybindings</li>
<li>init-rg                   → Ripgrep integration</li>
<li>init-spell                → Spell checking</li>
<li>init-packages             → Package initialization</li>
<li>init-lsp                  → Language Server Protocol</li>
<li>init-evil                 → Vim emulation</li>
<li>init-undo                 → Undo configuration</li>
<li>init-keyfreq              → Key frequency tracking</li>
<li>init-org                  → Org-mode configuration</li>
<li>init-ssh                  → SSH connections</li>
<li>init-ai                   → AI/LLM integration (gptel, claude-code-ide)</li>
<li>init-modeline             → Mode line configuration</li>
<li>init-window               → Window management (winum)</li>
<li>init-chinese              → Chinese font support</li>
<li>init-better-defaults      → Improved defaults</li>
<li>init-ui                   → Visual theme and styling</li>
<li>org-ui.el                 → Org-specific UI</li>
</ul>
</div>
</div>
</div>
