orgs/My-Emacs-Configuration-2026.org
* Core Features Overview

| Feature                 | Description                                               |
|-------------------------|-----------------------------------------------------------|
| AI/LLM Integration      | GPTEL (OpenRouter), Claude Code IDE, Aider (DeepSeek)     |
| Python Development      | LSP (eglot), anaconda-mode, python-black, conda integration |
| Org Mode                | Notes, publishing, literate programming, Babel             |
| Vim Emulation           | Evil mode with custom leader keys                         |
| Code Navigation         | Citre (ctags), xref, highlight-symbol                    |
| Productivity            | Yasnippet, smartparens, rainbow-delimiters               |
| Shell Integration       | vterm, eshell, SSH via tramp                              |
| UI/Theming              | doom-dracula theme, doom-modeline, marginalia              |
| Version Control         | git-gutter, magit                                         |
| Web Development         | web-mode, js2-mode, emmet-mode                           |

* Keybindings Reference

** Global Keybindings

| Keybinding    | Function                              | Description                              |
|---------------|---------------------------------------|------------------------------------------|
| C-\           | comment-line                          | Comment/uncomment current line           |
| C-a           | mwim-beginning-of-code-or-line        | Go to beginning of code/line             |
| C-e           | mwim-end-of-code-or-line              | Go to end of code/line                    |
| C-s           | swiper                                | Incremental search with candidates        |
| C-f5          | lz/nohup-switch-run                   | Run current file (auto-detect bash/python) |
| F1            | restart-emacs                         | Restart Emacs                            |
| F2            | open-my-init-file                     | Open init.el                             |
| TAB           | my/indent-4-space                     | Indent region or insert 4 spaces         |
| S-TAB         | my/indent-4-space (with arg)          | Dedent region or delete 4 spaces         |
| M-0           | next-multiframe-window                | Go to next window                        |
| M-9           | previous-multiframe-window            | Go to previous window                     |
| M-r           | query-replace                         | Find and replace                          |
| M-s           | counsel-rg                            | Ripgrep search                           |
| C-x C-b       | ibuffer                               | Buffer manager                           |
| C-x 4 <num>   | -                                     | Split to 4 horizontal windows            |
| C-x 5 <num>   | -                                     | Split to 3 horizontal windows            |
| C-x 6 <num>   | -                                     | Split to 5 mixed windows                 |

** Evil Mode Leader Key (SPC)

All keybindings below are prefixed with =SPC= in Evil Normal/Visual mode.

*** File & Buffer Management

| Keybinding | Function                    | Description                     |
|------------|-----------------------------|---------------------------------|
| SPC xs     | save-buffer                 | Save current buffer             |
| SPC xf     | find-file                   | Find file                       |
| SPC xr     | recentf-open-files          | Open recent file                |
| SPC xb     | switch-to-buffer            | Switch buffer                   |
| SPC xk     | kill-buffer                 | Kill buffer                     |
| SPC xc     | save-buffers-kill-terminal | Save and close                  |
| SPC bb     | -                           | Switch to last buffer           |
| SPC bf     | eglot-format-buffer         | Format buffer                   |

*** Window Management

| Keybinding | Function                              | Description                         |
|------------|---------------------------------------|-------------------------------------|
| SPC x0     | delete-window                         | Close current window                |
| SPC x1     | delete-other-windows                  | Maximize current window             |
| SPC x2     | split-window-below                    | Split horizontally                  |
| SPC x3     | split-window-right                    | Split vertically                    |
| SPC x5     | split-3-windows-horizontally-evenly   | 3-way horizontal split              |
| SPC jj     | scroll-other-window                   | Scroll other window down            |
| SPC kk     | scroll-other-window-up                | Scroll other window up              |

*** Help & Documentation

| Keybinding | Function                       | Description                 |
|------------|--------------------------------|-----------------------------|
| SPC hf     | counsel-describe-function      | Describe function           |
| SPC hv     | counsel-describe-variable      | Describe variable           |
| SPC hk     | describe-key                   | Describe key                |
| SPC hm     | describe-mode                  | Describe mode               |

