docs/My-Emacs-Configuration-2026.html
<div id="outline-container-orga16af4e" class="outline-2">
<h2 id="orga16af4e"><span class="section-number-2">3.</span> Core Features Overview</h2>
<div class="outline-text-2" id="text-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">AI/LLM Integration</td>
<td class="org-left">GPTEL (OpenRouter), Claude Code IDE, Aider (DeepSeek)</td>
</tr>

<tr>
<td class="org-left">Python Development</td>
<td class="org-left">LSP (eglot), anaconda-mode, python-black, conda integration</td>
</tr>

<tr>
<td class="org-left">Org Mode</td>
<td class="org-left">Notes, publishing, literate programming, Babel</td>
</tr>

<tr>
<td class="org-left">Vim Emulation</td>
<td class="org-left">Evil mode with custom leader keys</td>
</tr>

<tr>
<td class="org-left">Code Navigation</td>
<td class="org-left">Citre (ctags), xref, highlight-symbol</td>
</tr>

<tr>
<td class="org-left">Productivity</td>
<td class="org-left">Yasnippet, smartparens, rainbow-delimiters</td>
</tr>

<tr>
<td class="org-left">Shell Integration</td>
<td class="org-left">vterm, eshell, SSH via tramp</td>
</tr>

<tr>
<td class="org-left">UI/Theming</td>
<td class="org-left">doom-dracula theme, doom-modeline, marginalia</td>
</tr>

<tr>
<td class="org-left">Version Control</td>
<td class="org-left">git-gutter, magit</td>
</tr>

<tr>
<td class="org-left">Web Development</td>
<td class="org-left">web-mode, js2-mode, emmet-mode</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3a2f770" class="outline-2">
<h2 id="org3a2f770"><span class="section-number-2">4.</span> Keybindings Reference</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org581e8c5" class="outline-3">
<h3 id="org581e8c5"><span class="section-number-3">4.1.</span> Global Keybindings</h3>
<div class="outline-text-3" id="text-4-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-\</td>
<td class="org-left">comment-line</td>
<td class="org-left">Comment/uncomment current line</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">mwim-beginning-of-code-or-line</td>
<td class="org-left">Go to beginning of code/line</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">mwim-end-of-code-or-line</td>
<td class="org-left">Go to end of code/line</td>
</tr>

<tr>
<td class="org-left">C-s</td>
<td class="org-left">swiper</td>
<td class="org-left">Incremental search with candidates</td>
</tr>

<tr>
<td class="org-left">C-f5</td>
<td class="org-left">lz/nohup-switch-run</td>
<td class="org-left">Run current file (auto-detect bash/python)</td>
</tr>

<tr>
<td class="org-left">F1</td>
<td class="org-left">restart-emacs</td>
<td class="org-left">Restart Emacs</td>
</tr>

<tr>
<td class="org-left">F2</td>
<td class="org-left">open-my-init-file</td>
<td class="org-left">Open init.el</td>
</tr>

<tr>
<td class="org-left">TAB</td>
<td class="org-left">my/indent-4-space</td>
<td class="org-left">Indent region or insert 4 spaces</td>
</tr>

<tr>
<td class="org-left">S-TAB</td>
<td class="org-left">my/indent-4-space (with arg)</td>
<td class="org-left">Dedent region or delete 4 spaces</td>
</tr>

<tr>
<td class="org-left">M-0</td>
<td class="org-left">next-multiframe-window</td>
<td class="org-left">Go to next window</td>
</tr>

<tr>
<td class="org-left">M-9</td>
<td class="org-left">previous-multiframe-window</td>
<td class="org-left">Go to previous window</td>
</tr>

<tr>
<td class="org-left">M-r</td>
<td class="org-left">query-replace</td>
<td class="org-left">Find and replace</td>
</tr>

<tr>
<td class="org-left">M-s</td>
<td class="org-left">counsel-rg</td>
<td class="org-left">Ripgrep search</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">ibuffer</td>
<td class="org-left">Buffer manager</td>
</tr>

<tr>
<td class="org-left">C-x 4 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">Split to 4 horizontal windows</td>
</tr>

<tr>
<td class="org-left">C-x 5 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">Split to 3 horizontal windows</td>
</tr>

<tr>
<td class="org-left">C-x 6 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">Split to 5 mixed windows</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9112e2b" class="outline-3">
<h3 id="org9112e2b"><span class="section-number-3">4.2.</span> Evil Mode Leader Key (SPC)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
All keybindings below are prefixed with <code>SPC</code> in Evil Normal/Visual mode.
</p>
</div>
<div id="outline-container-org3b41103" class="outline-4">
<h4 id="org3b41103"><span class="section-number-4">4.2.1.</span> File &amp; Buffer Management</h4>
<div class="outline-text-4" id="text-4-2-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC xs</td>
<td class="org-left">save-buffer</td>
<td class="org-left">Save current buffer</td>
</tr>

<tr>
<td class="org-left">SPC xf</td>
<td class="org-left">find-file</td>
<td class="org-left">Find file</td>
</tr>

<tr>
<td class="org-left">SPC xr</td>
<td class="org-left">recentf-open-files</td>
<td class="org-left">Open recent file</td>
</tr>

<tr>
<td class="org-left">SPC xb</td>
<td class="org-left">switch-to-buffer</td>
<td class="org-left">Switch buffer</td>
</tr>

<tr>
<td class="org-left">SPC xk</td>
<td class="org-left">kill-buffer</td>
<td class="org-left">Kill buffer</td>
</tr>

<tr>
<td class="org-left">SPC xc</td>
<td class="org-left">save-buffers-kill-terminal</td>
<td class="org-left">Save and close</td>
</tr>

<tr>
<td class="org-left">SPC bb</td>
<td class="org-left">-</td>
<td class="org-left">Switch to last buffer</td>
</tr>

<tr>
<td class="org-left">SPC bf</td>
<td class="org-left">eglot-format-buffer</td>
<td class="org-left">Format buffer</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge528fe4" class="outline-4">
<h4 id="orge528fe4"><span class="section-number-4">4.2.2.</span> Window Management</h4>
<div class="outline-text-4" id="text-4-2-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC x0</td>
<td class="org-left">delete-window</td>
<td class="org-left">Close current window</td>
</tr>

<tr>
<td class="org-left">SPC x1</td>
<td class="org-left">delete-other-windows</td>
<td class="org-left">Maximize current window</td>
</tr>

<tr>
<td class="org-left">SPC x2</td>
<td class="org-left">split-window-below</td>
<td class="org-left">Split horizontally</td>
</tr>

<tr>
<td class="org-left">SPC x3</td>
<td class="org-left">split-window-right</td>
<td class="org-left">Split vertically</td>
</tr>

<tr>
<td class="org-left">SPC x5</td>
<td class="org-left">split-3-windows-horizontally-evenly</td>
<td class="org-left">3-way horizontal split</td>
</tr>

<tr>
<td class="org-left">SPC jj</td>
<td class="org-left">scroll-other-window</td>
<td class="org-left">Scroll other window down</td>
</tr>

<tr>
<td class="org-left">SPC kk</td>
<td class="org-left">scroll-other-window-up</td>
<td class="org-left">Scroll other window up</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org28569d5" class="outline-4">
<h4 id="org28569d5"><span class="section-number-4">4.2.3.</span> Help &amp; Documentation</h4>
<div class="outline-text-4" id="text-4-2-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC hf</td>
<td class="org-left">counsel-describe-function</td>
<td class="org-left">Describe function</td>
</tr>

<tr>
<td class="org-left">SPC hv</td>
<td class="org-left">counsel-describe-variable</td>
<td class="org-left">Describe variable</td>
</tr>

<tr>
<td class="org-left">SPC hk</td>
<td class="org-left">describe-key</td>
<td class="org-left">Describe key</td>
</tr>

<tr>
<td class="org-left">SPC hm</td>
<td class="org-left">describe-mode</td>
<td class="org-left">Describe mode</td>
</tr>
</tbody>
</table>
</div>
</div>
