orgs/My-Emacs-Configuration-2026.org
*** Code Navigation & Editing

| Keybinding | Function                          | Description                      |
|------------|-----------------------------------|----------------------------------|
| SPC gd     | evil-goto-definition              | Go to definition                 |
| SPC hs     | highlight-symbol                  | Highlight symbol                 |
| SPC sr     | highlight-symbol-query-replace    | Replace highlighted symbol       |
| SPC sn     | highlight-symbol-nav-mode         | Navigate highlights (M-n/M-p)   |
| SPC hl     | hs-hide-level                     | Hide code blocks by level        |
| SPC sl     | hs-show-block                     | Show code block                  |
| SPC er     | eglot-rename                      | Rename symbol                    |

*** Citre Code Navigation

| Keybinding | Function                         | Description                  |
|------------|----------------------------------|------------------------------|
| SPC cu     | citre-update-this-tags-file      | Update ctags file            |
| SPC cd     | citre-jump                       | Jump to definition           |
| SPC cD     | citre-jump-back                  | Jump back                    |
| SPC cp     | citre-ace-peek                  | Peek at definition           |

*** Anaconda Mode (Python)

| Keybinding | Function                                        | Description                      |
|------------|-------------------------------------------------|----------------------------------|
| SPC ad     | anaconda-mode-find-definitions                  | Find definition                  |
| SPC ar     | anaconda-mode-find-references                  | Find references                  |
| SPC aD     | anaconda-mode-find-definitions-other-window    | Find in other window             |
| SPC aR     | anaconda-mode-find-references-other-window     | Find references other window     |
| SPC aa     | anaconda-mode-find-assignments                 | Find assignments                 |
| SPC a/     | anaconda-mode-show-doc                         | Show documentation               |

*** Python Scripts (F5 / nohup)

| Keybinding | Function                                | Description                       |
|------------|-----------------------------------------|-----------------------------------|
| SPC rb     | lz/running-current-bash-with-nohup      | Run bash script in background    |
| SPC rp     | lz/running-current-python-with-nohup   | Run Python script with conda     |
| SPC ro     | lz/run-occupy-python                    | Occupy GPU device                 |
| SPC rt     | lz/open-tensorboard-in-current-buffer   | Open TensorBoard                  |
| SPC ns     | lz/look-nvidia-state                    | Check GPU status                  |

*** SSH Connections

| Keybinding       | Function                 | Description                        |
|------------------|-------------------------|------------------------------------|
| SPC 141          | ssh-connect-141         | Connect to 10.21.20.141            |
| SPC 142          | ssh-connect-142         | Connect to 10.21.20.142            |
| SPC cs1          | ssh-connect-cs1         | Connect to cs1.astaple.com         |
| SPC cs2          | ssh-connect-cs2         | Connect to cs2.astaple.com         |
| SPC gs9-gs16     | ssh-connect-gsN         | Connect to gsN.astaple.com         |
| SPC ocs1         | ssh-connect-fromout-cs1 | Connect via jump host              |
| SPC ogs9-ogs16   | ssh-connect-fromout-gsN | Connect via jump host              |

*** Clipboard & WSL

| Keybinding | Function                                                    | Description                      |
|------------|-------------------------------------------------------------|----------------------------------|
| SPC sy     | wsl-copy-region-to-clipboard                                | Copy to Windows clipboard        |
| SPC sd     | wsl-cut-region-to-clipboard                                | Cut to Windows clipboard         |
| SPC si     | my-yank-image-from-win-clipboard-through-powershell         | Paste image from Windows         |

*** Shell

| Keybinding | Function              | Description              |
|------------|-----------------------|--------------------------|
| SPC sh     | shell                 | Open shell              |
| SPC sc     | shell-command         | Run shell command       |

*** English & Spell

| Keybinding | Function                            | Description                |
|------------|-------------------------------------|----------------------------|
| SPC cy     | gt-translate                        | Translate text             |
| SPC te     | toggle-company-english-helper       | Toggle English helper      |
| SPC is     | ispell-buffer                       | Spell check buffer         |
| SPC fs     | flyspell-mode                       | Toggle spell checking      |

