docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org64e75e4" class="outline-4">
<h4 id="org64e75e4"><span class="section-number-4">4.2.4.</span> Code Navigation &amp; Editing</h4>
<div class="outline-text-4" id="text-4-2-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC gd</td>
<td class="org-left">evil-goto-definition</td>
<td class="org-left">Go to definition</td>
</tr>

<tr>
<td class="org-left">SPC hs</td>
<td class="org-left">highlight-symbol</td>
<td class="org-left">Highlight symbol</td>
</tr>

<tr>
<td class="org-left">SPC sr</td>
<td class="org-left">highlight-symbol-query-replace</td>
<td class="org-left">Replace highlighted symbol</td>
</tr>

<tr>
<td class="org-left">SPC sn</td>
<td class="org-left">highlight-symbol-nav-mode</td>
<td class="org-left">Navigate highlights (M-n/M-p)</td>
</tr>

<tr>
<td class="org-left">SPC hl</td>
<td class="org-left">hs-hide-level</td>
<td class="org-left">Hide code blocks by level</td>
</tr>

<tr>
<td class="org-left">SPC sl</td>
<td class="org-left">hs-show-block</td>
<td class="org-left">Show code block</td>
</tr>

<tr>
<td class="org-left">SPC er</td>
<td class="org-left">eglot-rename</td>
<td class="org-left">Rename symbol</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3daff5e" class="outline-4">
<h4 id="org3daff5e"><span class="section-number-4">4.2.5.</span> Citre Code Navigation</h4>
<div class="outline-text-4" id="text-4-2-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC cu</td>
<td class="org-left">citre-update-this-tags-file</td>
<td class="org-left">Update ctags file</td>
</tr>

<tr>
<td class="org-left">SPC cd</td>
<td class="org-left">citre-jump</td>
<td class="org-left">Jump to definition</td>
</tr>

<tr>
<td class="org-left">SPC cD</td>
<td class="org-left">citre-jump-back</td>
<td class="org-left">Jump back</td>
</tr>

<tr>
<td class="org-left">SPC cp</td>
<td class="org-left">citre-ace-peek</td>
<td class="org-left">Peek at definition</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2ea7c88" class="outline-4">
<h4 id="org2ea7c88"><span class="section-number-4">4.2.6.</span> Anaconda Mode (Python)</h4>
<div class="outline-text-4" id="text-4-2-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC ad</td>
<td class="org-left">anaconda-mode-find-definitions</td>
<td class="org-left">Find definition</td>
</tr>

<tr>
<td class="org-left">SPC ar</td>
<td class="org-left">anaconda-mode-find-references</td>
<td class="org-left">Find references</td>
</tr>

<tr>
<td class="org-left">SPC aD</td>
<td class="org-left">anaconda-mode-find-definitions-other-window</td>
<td class="org-left">Find in other window</td>
</tr>

<tr>
<td class="org-left">SPC aR</td>
<td class="org-left">anaconda-mode-find-references-other-window</td>
<td class="org-left">Find references other window</td>
</tr>

<tr>
<td class="org-left">SPC aa</td>
<td class="org-left">anaconda-mode-find-assignments</td>
<td class="org-left">Find assignments</td>
</tr>

<tr>
<td class="org-left">SPC a/</td>
<td class="org-left">anaconda-mode-show-doc</td>
<td class="org-left">Show documentation</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org667760b" class="outline-4">
<h4 id="org667760b"><span class="section-number-4">4.2.7.</span> Python Scripts (F5 / nohup)</h4>
<div class="outline-text-4" id="text-4-2-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC rb</td>
<td class="org-left">lz/running-current-bash-with-nohup</td>
<td class="org-left">Run bash script in background</td>
</tr>

<tr>
<td class="org-left">SPC rp</td>
<td class="org-left">lz/running-current-python-with-nohup</td>
<td class="org-left">Run Python script with conda</td>
</tr>

<tr>
<td class="org-left">SPC ro</td>
<td class="org-left">lz/run-occupy-python</td>
<td class="org-left">Occupy GPU device</td>
</tr>

<tr>
<td class="org-left">SPC rt</td>
<td class="org-left">lz/open-tensorboard-in-current-buffer</td>
<td class="org-left">Open TensorBoard</td>
</tr>

<tr>
<td class="org-left">SPC ns</td>
<td class="org-left">lz/look-nvidia-state</td>
<td class="org-left">Check GPU status</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd0b4c24" class="outline-4">
<h4 id="orgd0b4c24"><span class="section-number-4">4.2.8.</span> SSH Connections</h4>
<div class="outline-text-4" id="text-4-2-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC 141</td>
<td class="org-left">ssh-connect-141</td>
<td class="org-left">Connect to 10.21.20.141</td>
</tr>

<tr>
<td class="org-left">SPC 142</td>
<td class="org-left">ssh-connect-142</td>
<td class="org-left">Connect to 10.21.20.142</td>
</tr>

<tr>
<td class="org-left">SPC cs1</td>
<td class="org-left">ssh-connect-cs1</td>
<td class="org-left">Connect to cs1.astaple.com</td>
</tr>

<tr>
<td class="org-left">SPC cs2</td>
<td class="org-left">ssh-connect-cs2</td>
<td class="org-left">Connect to cs2.astaple.com</td>
</tr>

<tr>
<td class="org-left">SPC gs9-gs16</td>
<td class="org-left">ssh-connect-gsN</td>
<td class="org-left">Connect to gsN.astaple.com</td>
</tr>

<tr>
<td class="org-left">SPC ocs1</td>
<td class="org-left">ssh-connect-fromout-cs1</td>
<td class="org-left">Connect via jump host</td>
</tr>

<tr>
<td class="org-left">SPC ogs9-ogs16</td>
<td class="org-left">ssh-connect-fromout-gsN</td>
<td class="org-left">Connect via jump host</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org79ee955" class="outline-4">
<h4 id="org79ee955"><span class="section-number-4">4.2.9.</span> Clipboard &amp; WSL</h4>
<div class="outline-text-4" id="text-4-2-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC sy</td>
<td class="org-left">wsl-copy-region-to-clipboard</td>
<td class="org-left">Copy to Windows clipboard</td>
</tr>

<tr>
<td class="org-left">SPC sd</td>
<td class="org-left">wsl-cut-region-to-clipboard</td>
<td class="org-left">Cut to Windows clipboard</td>
</tr>

<tr>
<td class="org-left">SPC si</td>
<td class="org-left">my-yank-image-from-win-clipboard-through-powershell</td>
<td class="org-left">Paste image from Windows</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org76fe390" class="outline-4">
<h4 id="org76fe390"><span class="section-number-4">4.2.10.</span> Shell</h4>
<div class="outline-text-4" id="text-4-2-10">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC sh</td>
<td class="org-left">shell</td>
<td class="org-left">Open shell</td>
</tr>

<tr>
<td class="org-left">SPC sc</td>
<td class="org-left">shell-command</td>
<td class="org-left">Run shell command</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3f5f8d0" class="outline-4">
<h4 id="org3f5f8d0"><span class="section-number-4">4.2.11.</span> English &amp; Spell</h4>
<div class="outline-text-4" id="text-4-2-11">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC cy</td>
<td class="org-left">gt-translate</td>
<td class="org-left">Translate text</td>
</tr>

<tr>
<td class="org-left">SPC te</td>
<td class="org-left">toggle-company-english-helper</td>
<td class="org-left">Toggle English helper</td>
</tr>

<tr>
<td class="org-left">SPC is</td>
<td class="org-left">ispell-buffer</td>
<td class="org-left">Spell check buffer</td>
</tr>

<tr>
<td class="org-left">SPC fs</td>
<td class="org-left">flyspell-mode</td>
<td class="org-left">Toggle spell checking</td>
</tr>
</tbody>
</table>
</div>
</div>
