orgs/My-Emacs-Configuration-2026.org
*** Org Mode

| Keybinding | Function                    | Description                     |
|------------|-----------------------------|--------------------------------|
| SPC ii     | my-screen-capture           | Screen capture to org          |
| SPC ih     | fastinsert-org-head         | Insert org header              |
| SPC ic     | org-insert-src-block        | Insert source block            |
| SPC op     | org-publish                 | Publish org project            |
| SPC on     | open-org-note               | Open org note                  |
| SPC ow     | open-worklog-in-d           | Open worklog                   |

*** Hide/Show Code

| Keybinding | Function                         | Description                    |
|------------|----------------------------------|--------------------------------|
| SPC s1     | latex-cover-region-with@zl      | Wrap region in LaTeX command   |

*** Collections

| Keybinding | Function         | Description              |
|------------|------------------|--------------------------|
| SPC ec     | collected-run    | Run collected command    |

** Evil State Navigation

| Keybinding | Function                      | Description                         |
|------------|-------------------------------|-------------------------------------|
| C-e        | mwim-end-of-line-or-code      | Go to end of line/code (Evil Normal) |
| C-p        | previous-line                 | Previous line (Evil Normal)          |
| C-n        | next-line                     | Next line (Evil Normal)              |
| C-b        | backward-char                 | Backward char (Evil Normal)          |
| C-f        | forward-char                  | Forward char (Evil Normal)           |
| C-v        | scroll-up-command             | Scroll up (Evil Normal)              |

** Evil Escape

| Keybinding | Function | Description                        |
|------------|----------|------------------------------------|
| kj         | -        | Escape from insert mode (0.3s delay) |

** Window Navigation (winum)

| Keybinding | Function                       | Description                |
|------------|--------------------------------|----------------------------|
| M-0        | winum-select-window-0-or-10  | Select window 0 or 10      |
| M-1        | winum-select-window-1         | Select window 1            |
| M-2        | winum-select-window-2         | Select window 2            |
| M-3        | winum-select-window-3         | Select window 3            |
| M-4        | winum-select-window-4         | Select window 4            |
| M-5        | winum-select-window-5         | Select window 5            |
| M-6        | winum-select-window-6         | Select window 6            |
| M-7        | winum-select-window-7         | Select window 7            |
| M-8        | winum-select-window-8         | Select window 8            |

** Ivy/Counsel Search

| Keybinding  | Function                         | Description                  |
|-------------|----------------------------------|------------------------------|
| M-x         | counsel-M-x                      | Execute command              |
| C-x C-f     | counsel-find-file                | Find file with completion    |
| C-x b       | counsel-switch-buffer            | Switch buffer                |
| C-x B       | counsel-switch-buffer-other-window | Switch buffer (other window) |
| C-x C-r     | counsel-recentf                  | Open recent file             |
| C-h f       | counsel-describe-function        | Describe function            |
| C-h v       | counsel-describe-variable        | Describe variable            |
| C-h C-k     | find-function-on-key             | Find key definition          |
| C-c C-r     | ivy-resume                       | Resume last search           |

** Org Mode Keybindings

| Keybinding | Function                  | Description                     |
|------------|---------------------------|---------------------------------|
| C-c l      | org-store-link            | Store link                      |
| C-c s e    | org-edit-src-code         | Edit source block               |
| C-c s i    | org-insert-src-block      | Insert source block             |
| C-f h      | fastinsert-org-head       | Insert org header template      |

** Python Development

| Keybinding | Function              | Description                              |
|------------|-----------------------|------------------------------------------|
| F5         | lz/nohup-switch-run   | Run current file (auto-detect bash/python) |

** Citre Code Navigation

| Keybinding | Function                          | Description                  |
|------------|-----------------------------------|------------------------------|
| C-x c j    | citre-jump                        | Jump to definition           |
| C-x c J    | citre-jump-back                   | Jump back                    |
| C-x c p    | citre-ace-peek                    | Ace peek                     |
| C-x c u    | citre-update-this-tags-file       | Update tags                  |

