docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org6d7e855" class="outline-4">
<h4 id="org6d7e855"><span class="section-number-4">4.2.12.</span> Org Mode</h4>
<div class="outline-text-4" id="text-4-2-12">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC ii</td>
<td class="org-left">my-screen-capture</td>
<td class="org-left">Screen capture to org</td>
</tr>

<tr>
<td class="org-left">SPC ih</td>
<td class="org-left">fastinsert-org-head</td>
<td class="org-left">Insert org header</td>
</tr>

<tr>
<td class="org-left">SPC ic</td>
<td class="org-left">org-insert-src-block</td>
<td class="org-left">Insert source block</td>
</tr>

<tr>
<td class="org-left">SPC op</td>
<td class="org-left">org-publish</td>
<td class="org-left">Publish org project</td>
</tr>

<tr>
<td class="org-left">SPC on</td>
<td class="org-left">open-org-note</td>
<td class="org-left">Open org note</td>
</tr>

<tr>
<td class="org-left">SPC ow</td>
<td class="org-left">open-worklog-in-d</td>
<td class="org-left">Open worklog</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8cbfba5" class="outline-4">
<h4 id="org8cbfba5"><span class="section-number-4">4.2.13.</span> Hide/Show Code</h4>
<div class="outline-text-4" id="text-4-2-13">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC s1</td>
<td class="org-left">latex-cover-region-with@zl</td>
<td class="org-left">Wrap region in LaTeX command</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0c1eda8" class="outline-4">
<h4 id="org0c1eda8"><span class="section-number-4">4.2.14.</span> Collections</h4>
<div class="outline-text-4" id="text-4-2-14">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC ec</td>
<td class="org-left">collected-run</td>
<td class="org-left">Run collected command</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org7b74c69" class="outline-3">
<h3 id="org7b74c69"><span class="section-number-3">4.3.</span> Evil State Navigation</h3>
<div class="outline-text-3" id="text-4-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-e</td>
<td class="org-left">mwim-end-of-line-or-code</td>
<td class="org-left">Go to end of line/code (Evil Normal)</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">previous-line</td>
<td class="org-left">Previous line (Evil Normal)</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">next-line</td>
<td class="org-left">Next line (Evil Normal)</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">backward-char</td>
<td class="org-left">Backward char (Evil Normal)</td>
</tr>

<tr>
<td class="org-left">C-f</td>
<td class="org-left">forward-char</td>
<td class="org-left">Forward char (Evil Normal)</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">scroll-up-command</td>
<td class="org-left">Scroll up (Evil Normal)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgeb42b0d" class="outline-3">
<h3 id="orgeb42b0d"><span class="section-number-3">4.4.</span> Evil Escape</h3>
<div class="outline-text-3" id="text-4-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">kj</td>
<td class="org-left">-</td>
<td class="org-left">Escape from insert mode (0.3s delay)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcadceec" class="outline-3">
<h3 id="orgcadceec"><span class="section-number-3">4.5.</span> Window Navigation (winum)</h3>
<div class="outline-text-3" id="text-4-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-0</td>
<td class="org-left">winum-select-window-0-or-10</td>
<td class="org-left">Select window 0 or 10</td>
</tr>

<tr>
<td class="org-left">M-1</td>
<td class="org-left">winum-select-window-1</td>
<td class="org-left">Select window 1</td>
</tr>

<tr>
<td class="org-left">M-2</td>
<td class="org-left">winum-select-window-2</td>
<td class="org-left">Select window 2</td>
</tr>

<tr>
<td class="org-left">M-3</td>
<td class="org-left">winum-select-window-3</td>
<td class="org-left">Select window 3</td>
</tr>

<tr>
<td class="org-left">M-4</td>
<td class="org-left">winum-select-window-4</td>
<td class="org-left">Select window 4</td>
</tr>

<tr>
<td class="org-left">M-5</td>
<td class="org-left">winum-select-window-5</td>
<td class="org-left">Select window 5</td>
</tr>

<tr>
<td class="org-left">M-6</td>
<td class="org-left">winum-select-window-6</td>
<td class="org-left">Select window 6</td>
</tr>

<tr>
<td class="org-left">M-7</td>
<td class="org-left">winum-select-window-7</td>
<td class="org-left">Select window 7</td>
</tr>

<tr>
<td class="org-left">M-8</td>
<td class="org-left">winum-select-window-8</td>
<td class="org-left">Select window 8</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5f02f34" class="outline-3">
<h3 id="org5f02f34"><span class="section-number-3">4.6.</span> Ivy/Counsel Search</h3>
<div class="outline-text-3" id="text-4-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-x</td>
<td class="org-left">counsel-M-x</td>
<td class="org-left">Execute command</td>
</tr>

<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">counsel-find-file</td>
<td class="org-left">Find file with completion</td>
</tr>

<tr>
<td class="org-left">C-x b</td>
<td class="org-left">counsel-switch-buffer</td>
<td class="org-left">Switch buffer</td>
</tr>

<tr>
<td class="org-left">C-x B</td>
<td class="org-left">counsel-switch-buffer-other-window</td>
<td class="org-left">Switch buffer (other window)</td>
</tr>

<tr>
<td class="org-left">C-x C-r</td>
<td class="org-left">counsel-recentf</td>
<td class="org-left">Open recent file</td>
</tr>

<tr>
<td class="org-left">C-h f</td>
<td class="org-left">counsel-describe-function</td>
<td class="org-left">Describe function</td>
</tr>

<tr>
<td class="org-left">C-h v</td>
<td class="org-left">counsel-describe-variable</td>
<td class="org-left">Describe variable</td>
</tr>

<tr>
<td class="org-left">C-h C-k</td>
<td class="org-left">find-function-on-key</td>
<td class="org-left">Find key definition</td>
</tr>

<tr>
<td class="org-left">C-c C-r</td>
<td class="org-left">ivy-resume</td>
<td class="org-left">Resume last search</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf2de5b7" class="outline-3">
<h3 id="orgf2de5b7"><span class="section-number-3">4.7.</span> Org Mode Keybindings</h3>
<div class="outline-text-3" id="text-4-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c l</td>
<td class="org-left">org-store-link</td>
<td class="org-left">Store link</td>
</tr>

<tr>
<td class="org-left">C-c s e</td>
<td class="org-left">org-edit-src-code</td>
<td class="org-left">Edit source block</td>
</tr>

<tr>
<td class="org-left">C-c s i</td>
<td class="org-left">org-insert-src-block</td>
<td class="org-left">Insert source block</td>
</tr>

<tr>
<td class="org-left">C-f h</td>
<td class="org-left">fastinsert-org-head</td>
<td class="org-left">Insert org header template</td>
</tr>
</tbody>
</table>
</div>
</div>
