docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org4dff0d6" class="outline-3">
<h3 id="org4dff0d6"><span class="section-number-3">4.8.</span> Python Development</h3>
<div class="outline-text-3" id="text-4-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">F5</td>
<td class="org-left">lz/nohup-switch-run</td>
<td class="org-left">Run current file (auto-detect bash/python)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd77cff6" class="outline-3">
<h3 id="orgd77cff6"><span class="section-number-3">4.9.</span> Citre Code Navigation</h3>
<div class="outline-text-3" id="text-4-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x c j</td>
<td class="org-left">citre-jump</td>
<td class="org-left">Jump to definition</td>
</tr>

<tr>
<td class="org-left">C-x c J</td>
<td class="org-left">citre-jump-back</td>
<td class="org-left">Jump back</td>
</tr>

<tr>
<td class="org-left">C-x c p</td>
<td class="org-left">citre-ace-peek</td>
<td class="org-left">Ace peek</td>
</tr>

<tr>
<td class="org-left">C-x c u</td>
<td class="org-left">citre-update-this-tags-file</td>
<td class="org-left">Update tags</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2d7a03c" class="outline-3">
<h3 id="org2d7a03c"><span class="section-number-3">4.10.</span> AI/LLM Keybindings</h3>
<div class="outline-text-3" id="text-4-10">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c C-'</td>
<td class="org-left">claude-code-ide-menu</td>
<td class="org-left">Claude Code IDE menu</td>
</tr>

<tr>
<td class="org-left">C-c a</td>
<td class="org-left">aidermacs-transient-menu</td>
<td class="org-left">Aider transient menu</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org26f8880" class="outline-3">
<h3 id="org26f8880"><span class="section-number-3">4.11.</span> UI Scaling</h3>
<div class="outline-text-3" id="text-4-11">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c C-=</td>
<td class="org-left">enable-150%-scale-big</td>
<td class="org-left">Increase UI scale 150%</td>
</tr>

<tr>
<td class="org-left">C-c C--</td>
<td class="org-left">enable-75%-scale-big</td>
<td class="org-left">Decrease UI scale 75%</td>
</tr>

<tr>
<td class="org-left">C-=</td>
<td class="org-left">text-scale-adjust (+0.5)</td>
<td class="org-left">Increase text size</td>
</tr>

<tr>
<td class="org-left">C--</td>
<td class="org-left">text-scale-adjust (-0.5)</td>
<td class="org-left">Decrease text size</td>
</tr>

<tr>
<td class="org-left">C-0</td>
<td class="org-left">text-scale-adjust (reset)</td>
<td class="org-left">Reset text size</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org80d4c74" class="outline-3">
<h3 id="org80d4c74"><span class="section-number-3">4.12.</span> Flymake Diagnostics</h3>
<div class="outline-text-3" id="text-4-12">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keybinding</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x e</td>
<td class="org-left">flymake-show-buffer-diagnostics</td>
<td class="org-left">Show diagnostics</td>
</tr>

<tr>
<td class="org-left">C-x n</td>
<td class="org-left">flymake-goto-next-error</td>
<td class="org-left">Next error</td>
</tr>

<tr>
<td class="org-left">C-x N</td>
<td class="org-left">flymake-goto-prev-error</td>
<td class="org-left">Previous error</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgc415343" class="outline-2">
<h2 id="orgc415343"><span class="section-number-2">5.</span> Package List</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6261ec2" class="outline-3">
<h3 id="org6261ec2"><span class="section-number-3">5.1.</span> Core Infrastructure</h3>
<div class="outline-text-3" id="text-5-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">use-package</td>
<td class="org-left">Declarative package configuration</td>
</tr>

<tr>
<td class="org-left">straight.el</td>
<td class="org-left">Package manager (optional, disabled)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org365ddf8" class="outline-3">
<h3 id="org365ddf8"><span class="section-number-3">5.2.</span> Vim Emulation (Evil)</h3>
<div class="outline-text-3" id="text-5-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">evil</td>
<td class="org-left">Vim emulation layer</td>
</tr>

<tr>
<td class="org-left">evil-escape</td>
<td class="org-left">Escape with "kj" sequence</td>
</tr>

<tr>
<td class="org-left">evil-surround</td>
<td class="org-left">Surround text objects</td>
</tr>

<tr>
<td class="org-left">evil-visualstar</td>
<td class="org-left">Search visual selection</td>
</tr>

<tr>
<td class="org-left">evil-leader</td>
<td class="org-left">Leader key support</td>
</tr>

<tr>
<td class="org-left">undo-fu</td>
<td class="org-left">Improved undo/redo</td>
</tr>

<tr>
<td class="org-left">general</td>
<td class="org-left">Keybinding definitions</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8b55638" class="outline-3">
<h3 id="org8b55638"><span class="section-number-3">5.3.</span> UI &amp; Themes</h3>
<div class="outline-text-3" id="text-5-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">doom-themes</td>
<td class="org-left">Theme collection (doom-dracula)</td>
</tr>

<tr>
<td class="org-left">doom-modeline</td>
<td class="org-left">Modern mode line</td>
</tr>

<tr>
<td class="org-left">all-the-icons</td>
<td class="org-left">Icon set</td>
</tr>

<tr>
<td class="org-left">all-the-icons-completion</td>
<td class="org-left">Icons in completion</td>
</tr>

<tr>
<td class="org-left">all-the-icons-dired</td>
<td class="org-left">Icons in dired</td>
</tr>

<tr>
<td class="org-left">nerd-icons</td>
<td class="org-left">Alternative icon set</td>
</tr>

<tr>
<td class="org-left">marginalia</td>
<td class="org-left">Enhanced minibuffer annotations</td>
</tr>

<tr>
<td class="org-left">highlight-indentation</td>
<td class="org-left">Indentation guides</td>
</tr>

<tr>
<td class="org-left">rainbow-delimiters</td>
<td class="org-left">Color-coded parentheses</td>
</tr>

<tr>
<td class="org-left">rainbow-mode</td>
<td class="org-left">Color codes</td>
</tr>

<tr>
<td class="org-left">beacon</td>
<td class="org-left">Cursor highlighting (disabled)</td>
</tr>

<tr>
<td class="org-left">winum</td>
<td class="org-left">Window number navigation</td>
</tr>

<tr>
<td class="org-left">ivy-posframe</td>
<td class="org-left">Ivy in posframe</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5aad5df" class="outline-3">
<h3 id="org5aad5df"><span class="section-number-3">5.4.</span> Python Development</h3>
<div class="outline-text-3" id="text-5-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">python</td>
<td class="org-left">Built-in Python mode</td>
</tr>

<tr>
<td class="org-left">anaconda-mode</td>
<td class="org-left">Python code navigation (commented)</td>
</tr>

<tr>
<td class="org-left">company-anaconda</td>
<td class="org-left">Company backend (commented)</td>
</tr>

<tr>
<td class="org-left">python-black</td>
<td class="org-left">Code formatting (commented)</td>
</tr>

<tr>
<td class="org-left">pyenv-mode</td>
<td class="org-left">Python env switching (commented)</td>
</tr>

<tr>
<td class="org-left">elpy</td>
<td class="org-left">Python IDE (commented)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org263ce3d" class="outline-3">
<h3 id="org263ce3d"><span class="section-number-3">5.5.</span> Language Server Protocol</h3>
<div class="outline-text-3" id="text-5-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">eglot</td>
<td class="org-left">LSP client (built-in)</td>
</tr>

<tr>
<td class="org-left">pyright-langserver</td>
<td class="org-left">Python LSP server</td>
</tr>

<tr>
<td class="org-left">copilot</td>
<td class="org-left">GitHub Copilot</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org627b55b" class="outline-3">
<h3 id="org627b55b"><span class="section-number-3">5.6.</span> Code Navigation</h3>
<div class="outline-text-3" id="text-5-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">citre</td>
<td class="org-left">Tags-based code navigation</td>
</tr>

<tr>
<td class="org-left">projectile</td>
<td class="org-left">Project management</td>
</tr>

<tr>
<td class="org-left">xref</td>
<td class="org-left">Cross-reference navigation</td>
</tr>

<tr>
<td class="org-left">highlight-symbol</td>
<td class="org-left">Symbol highlighting</td>
</tr>
</tbody>
</table>
</div>
</div>
