orgs/My-Emacs-Configuration-2026.org
** Org Mode

| Package              | Description                         |
|----------------------|-------------------------------------|
| org                 | Built-in outline/note-taking        |
| org-roam            | Roam knowledge base                 |
| org-roam-protocol   | org-protocol for roam               |
| org-bullets         | Bullet points                       |
| org-alert           | Desktop notifications               |
| org-download        | Image attachments                   |
| htmlize             | HTML export for org                 |
| ox-publish          | Publishing static sites             |

** Snippets & Templates

| Package   | Description                    |
|-----------|--------------------------------|
| yasnippet | Template snippets             |
| autoinsert| Automatic file templates      |
| cdlatex   | LaTeX input shortcuts         |

** AI/LLM Integration

| Package           | Description                       |
|-------------------|-----------------------------------|
| gptel             | Generic LLM interface             |
| claude-code-ide   | Claude Code integration           |
| aidermacs         | Aider AI coding assistant         |

** Shell & Terminal

| Package         | Description                       |
|-----------------|-----------------------------------|
| vterm           | Fast terminal emulator            |
| eshell          | Emacs shell                       |
| tramp           | Remote file editing               |
| counsel-tramp   | Counsel interface (commented)    |

** Version Control

| Package   | Description               |
|-----------|---------------------------|
| magit     | Git interface             |
| git-gutter| Diff indicators in gutter |

** Web Development

| Package         | Description               |
|-----------------|---------------------------|
| web-mode        | HTML editing              |
| js2-mode        | JavaScript editing       |
| js2-refactor    | JavaScript refactoring   |
| emmet-mode      | Zen coding                |

** Other Languages

| Package          | Description                        |
|------------------|------------------------------------|
| rust-mode        | Rust editing                       |
| rustic          | Rust toolkit                       |
| cider           | Clojure REPL                       |
| typescript-mode | TypeScript                         |
| auctex          | LaTeX editing                      |
| reftex          | LaTeX bibliography (commented)     |
| company-auctex  | Company backend for LaTeX (commented) |
| leetcode        | LeetCode integration               |

** Productivity

| Package              | Description                        |
|----------------------|------------------------------------|
| elfeed              | RSS reader                         |
| elfeed-org          | Org-based RSS config               |
| ivy                 | Completion framework               |
| counsel             | Ivy commands                       |
| swiper              | Incremental search                 |
| smartparens         | Smart pair management              |
| hungry-delete       | Delete whitespace                  |
| which-key           | Keybinding hints                   |
| neotree             | File tree (commented)              |
| dirvish             | Dired alternative (commented)      |
| command-log-mode    | Command history                    |

** Utilities

| Package          | Description                        |
|------------------|------------------------------------|
| company          | Text completion                     |
| flymake          | On-the-fly syntax checking         |
| hungry-delete    | Delete multiple spaces             |
| ace-flyspell     | Ace jump to flyspell error         |
| keyfreq          | Track key frequency                |
| undo-tree        | Visual undo tree (replaced)       |
| rg               | Ripgrep integration                |

* Configuration Files

** init-ai.el - AI/LLM Integration

#+BEGIN_SRC elisp
;; GPTEL (OpenRouter)
(setq gptel-model "qwen/qwen3.6-plus-preview:free")
(setq gptel-backend
      (gptel-make-openai "OpenRouter"
        :host "openrouter.ai"
        :endpoint "/api/v1/chat/completions"
        :stream t
        :key (lambda () (getenv "OPENROUTER_API_KEY"))))

;; Claude Code IDE
(use-package claude-code-ide
  :vc (:url "https://github.com/manzaltu/claude-code-ide.el" :rev :newest)
  :bind ("C-c C-'" . claude-code-ide-menu)
  :config
  (claude-code-ide-emacs-tools-setup))
#+END_SRC

