docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org69740b7" class="outline-3">
<h3 id="org69740b7"><span class="section-number-3">5.7.</span> Org Mode</h3>
<div class="outline-text-3" id="text-5-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">org</td>
<td class="org-left">Built-in outline/note-taking</td>
</tr>

<tr>
<td class="org-left">org-roam</td>
<td class="org-left">Roam knowledge base</td>
</tr>

<tr>
<td class="org-left">org-roam-protocol</td>
<td class="org-left">org-protocol for roam</td>
</tr>

<tr>
<td class="org-left">org-bullets</td>
<td class="org-left">Bullet points</td>
</tr>

<tr>
<td class="org-left">org-alert</td>
<td class="org-left">Desktop notifications</td>
</tr>

<tr>
<td class="org-left">org-download</td>
<td class="org-left">Image attachments</td>
</tr>

<tr>
<td class="org-left">htmlize</td>
<td class="org-left">HTML export for org</td>
</tr>

<tr>
<td class="org-left">ox-publish</td>
<td class="org-left">Publishing static sites</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org99631a4" class="outline-3">
<h3 id="org99631a4"><span class="section-number-3">5.8.</span> Snippets &amp; Templates</h3>
<div class="outline-text-3" id="text-5-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">yasnippet</td>
<td class="org-left">Template snippets</td>
</tr>

<tr>
<td class="org-left">autoinsert</td>
<td class="org-left">Automatic file templates</td>
</tr>

<tr>
<td class="org-left">cdlatex</td>
<td class="org-left">LaTeX input shortcuts</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org733064a" class="outline-3">
<h3 id="org733064a"><span class="section-number-3">5.9.</span> AI/LLM Integration</h3>
<div class="outline-text-3" id="text-5-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">gptel</td>
<td class="org-left">Generic LLM interface</td>
</tr>

<tr>
<td class="org-left">claude-code-ide</td>
<td class="org-left">Claude Code integration</td>
</tr>

<tr>
<td class="org-left">aidermacs</td>
<td class="org-left">Aider AI coding assistant</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org10ca13f" class="outline-3">
<h3 id="org10ca13f"><span class="section-number-3">5.10.</span> Shell &amp; Terminal</h3>
<div class="outline-text-3" id="text-5-10">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">vterm</td>
<td class="org-left">Fast terminal emulator</td>
</tr>

<tr>
<td class="org-left">eshell</td>
<td class="org-left">Emacs shell</td>
</tr>

<tr>
<td class="org-left">tramp</td>
<td class="org-left">Remote file editing</td>
</tr>

<tr>
<td class="org-left">counsel-tramp</td>
<td class="org-left">Counsel interface (commented)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf8ac0b2" class="outline-3">
<h3 id="orgf8ac0b2"><span class="section-number-3">5.11.</span> Version Control</h3>
<div class="outline-text-3" id="text-5-11">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">magit</td>
<td class="org-left">Git interface</td>
</tr>

<tr>
<td class="org-left">git-gutter</td>
<td class="org-left">Diff indicators in gutter</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7229133" class="outline-3">
<h3 id="org7229133"><span class="section-number-3">5.12.</span> Web Development</h3>
<div class="outline-text-3" id="text-5-12">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">web-mode</td>
<td class="org-left">HTML editing</td>
</tr>

<tr>
<td class="org-left">js2-mode</td>
<td class="org-left">JavaScript editing</td>
</tr>

<tr>
<td class="org-left">js2-refactor</td>
<td class="org-left">JavaScript refactoring</td>
</tr>

<tr>
<td class="org-left">emmet-mode</td>
<td class="org-left">Zen coding</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfaf72cb" class="outline-3">
<h3 id="orgfaf72cb"><span class="section-number-3">5.13.</span> Other Languages</h3>
<div class="outline-text-3" id="text-5-13">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rust-mode</td>
<td class="org-left">Rust editing</td>
</tr>

<tr>
<td class="org-left">rustic</td>
<td class="org-left">Rust toolkit</td>
</tr>

<tr>
<td class="org-left">cider</td>
<td class="org-left">Clojure REPL</td>
</tr>

<tr>
<td class="org-left">typescript-mode</td>
<td class="org-left">TypeScript</td>
</tr>

<tr>
<td class="org-left">auctex</td>
<td class="org-left">LaTeX editing</td>
</tr>

<tr>
<td class="org-left">reftex</td>
<td class="org-left">LaTeX bibliography (commented)</td>
</tr>

<tr>
<td class="org-left">company-auctex</td>
<td class="org-left">Company backend for LaTeX (commented)</td>
</tr>

<tr>
<td class="org-left">leetcode</td>
<td class="org-left">LeetCode integration</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdb1690e" class="outline-3">
<h3 id="orgdb1690e"><span class="section-number-3">5.14.</span> Productivity</h3>
<div class="outline-text-3" id="text-5-14">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">elfeed</td>
<td class="org-left">RSS reader</td>
</tr>

<tr>
<td class="org-left">elfeed-org</td>
<td class="org-left">Org-based RSS config</td>
</tr>

<tr>
<td class="org-left">ivy</td>
<td class="org-left">Completion framework</td>
</tr>

<tr>
<td class="org-left">counsel</td>
<td class="org-left">Ivy commands</td>
</tr>

<tr>
<td class="org-left">swiper</td>
<td class="org-left">Incremental search</td>
</tr>

<tr>
<td class="org-left">smartparens</td>
<td class="org-left">Smart pair management</td>
</tr>

<tr>
<td class="org-left">hungry-delete</td>
<td class="org-left">Delete whitespace</td>
</tr>

<tr>
<td class="org-left">which-key</td>
<td class="org-left">Keybinding hints</td>
</tr>

<tr>
<td class="org-left">neotree</td>
<td class="org-left">File tree (commented)</td>
</tr>

<tr>
<td class="org-left">dirvish</td>
<td class="org-left">Dired alternative (commented)</td>
</tr>

<tr>
<td class="org-left">command-log-mode</td>
<td class="org-left">Command history</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org83263c5" class="outline-3">
<h3 id="org83263c5"><span class="section-number-3">5.15.</span> Utilities</h3>
<div class="outline-text-3" id="text-5-15">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">company</td>
<td class="org-left">Text completion</td>
</tr>

<tr>
<td class="org-left">flymake</td>
<td class="org-left">On-the-fly syntax checking</td>
</tr>

<tr>
<td class="org-left">hungry-delete</td>
<td class="org-left">Delete multiple spaces</td>
</tr>

<tr>
<td class="org-left">ace-flyspell</td>
<td class="org-left">Ace jump to flyspell error</td>
</tr>

<tr>
<td class="org-left">keyfreq</td>
<td class="org-left">Track key frequency</td>
</tr>

<tr>
<td class="org-left">undo-tree</td>
<td class="org-left">Visual undo tree (replaced)</td>
</tr>

<tr>
<td class="org-left">rg</td>
<td class="org-left">Ripgrep integration</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgd72eef7" class="outline-2">
<h2 id="orgd72eef7"><span class="section-number-2">6.</span> Configuration Files</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc43b1e3" class="outline-3">
<h3 id="orgc43b1e3"><span class="section-number-3">6.1.</span> init-ai.el - AI/LLM Integration</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">GPTEL (OpenRouter)
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> gptel-model <span style="color: #1cc24b;">"qwen/qwen3.6-plus-preview:free"</span><span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> gptel-backend
      <span style="color: #c770ff;">(</span>gptel-make-openai <span style="color: #1cc24b;">"OpenRouter"</span>
        <span style="color: #30b3ff;">:host</span> <span style="color: #1cc24b;">"openrouter.ai"</span>
        <span style="color: #30b3ff;">:endpoint</span> <span style="color: #1cc24b;">"/api/v1/chat/completions"</span>
        <span style="color: #30b3ff;">:stream</span> t
        <span style="color: #30b3ff;">:key</span> <span style="color: #e6ff57;">(</span><span style="color: #c770ff; font-weight: bold;">lambda</span> <span style="color: #30b3ff;">()</span> <span style="color: #30b3ff;">(</span>getenv <span style="color: #1cc24b;">"OPENROUTER_API_KEY"</span><span style="color: #30b3ff;">)</span><span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Claude Code IDE
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> claude-code-ide
  <span style="color: #30b3ff;">:vc</span> <span style="color: #c770ff;">(</span><span style="color: #30b3ff;">:url</span> <span style="color: #1cc24b;">"https://github.com/manzaltu/claude-code-ide.el"</span> <span style="color: #30b3ff;">:rev</span> <span style="color: #30b3ff;">:newest</span><span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:bind</span> <span style="color: #c770ff;">(</span><span style="color: #1cc24b;">"C-c C-'"</span> . claude-code-ide-menu<span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:config</span>
  <span style="color: #c770ff;">(</span>claude-code-ide-emacs-tools-setup<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
