orgs/My-Emacs-Configuration-2026.org
** init-openai.el - Aider (DeepSeek)

#+BEGIN_SRC elisp
(use-package aidermacs
  :bind ("C-c a" . aidermacs-transient-menu)
  :custom
  (aidermacs-default-model "deepseek")
  (aidermacs-architect-model "deepseek/deepseek-reasoner")
  (aidermacs-editor-model "deepseek/deepseek-chat")
  (aidermacs-backend 'vterm)
  (aidermacs-watch-files t))
#+END_SRC

** init-lsp.el - Language Server Protocol

#+BEGIN_SRC elisp
;; Eglot auto-starts for rust-mode and python-mode
(add-hook 'rust-mode-hook 'eglot-ensure)
(add-hook 'python-mode-hook 'eglot-ensure)

;; Copilot
(use-package copilot
  :vc (:url "https://github.com/copilot-emacs/copilot.el" :branch "main")
  :config
  (global-copilot-mode))
#+END_SRC

** init-org.el - Org Mode

#+BEGIN_SRC elisp
;; Custom tags
(setq org-tag-alist '(("@Research" . ?r) ("@Literature" . ?l) ("@Book" . ?b)))

;; Babel languages
(org-babel-do-load-languages 'org-babel-load-languages
  '((emacs-lisp . t) (ditaa . t) (python . t) (shell . t)
    (latex . t) (plantuml . t) (R . t)))

;; PlantUML
(setq org-plantuml-jar-path "~/.emacs.d/software/plantuml.jar")
(setq org-confirm-babel-evaluate nil)
#+END_SRC

** init-evil.el - Vim Emulation

#+BEGIN_SRC elisp
;; Evil escape
(setq-default evil-escape-delay 0.3)
(setq-default evil-escape-key-sequence "kj")

;; Undo-fu (improved undo)
(setq undo-limit 8000000 undo-strong-limit 8000000 undo-outer-limit 8000000)

;; Evil surround (per-mode pairs)
;; Shell: $ → $()
;; Org: [ → [[]], = → ==
;; Emacs-lisp: ( → ( ), ` → `'
;; Generic: / → //
#+END_SRC

** init-ui.el - Visual Configuration

#+BEGIN_SRC elisp
;; Theme
(load-theme 'doom-dracula t)

;; Font
(set-face-attribute 'default nil :font "Maple Mono 17" :weight 'normal)

;; CJK Font
(set-fontset-font t 'han '("LXGW WenKai Mono" . "微软雅黑"))

;; Hide UI elements
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; Line numbers
(when (fboundp 'display-line-numbers-mode)
  (global-display-line-numbers-mode))
#+END_SRC

** init-python.el - Python Development

#+BEGIN_SRC elisp
;; Run scripts with nohup
(defun lz/running-current-bash-with-nohup ()
  (interactive)
  ;; Runs: nohup bash <file> > timestamp-identify---runfile.log &

(defun lz/running-current-python-with-nohup ()
  (interactive)
  ;; Prompts for conda env, then runs: nohup $python <file> > ...

;; GPU management
(defun lz/run-occupy-python ()
  (interactive)
  ;; Occupy GPU device for testing

(defun lz/open-tensorboard-in-current-buffer ()
  (interactive)
  ;; Open TensorBoard in project directory
#+END_SRC

** init-ssh.el - SSH Connections

#+BEGIN_SRC elisp
;; Direct connections
ssh-connect-141    ; 10.21.20.141
ssh-connect-142    ; 10.21.20.142
ssh-connect-cs1    ; cs1.astaple.com
ssh-connect-cs2    ; cs2.astaple.com
ssh-connect-gs9-16 ; gsN.astaple.com

;; Via jump host (is1.astaple.com)
ssh-connect-fromout-cs1-2
ssh-connect-fromout-gs9-16
#+END_SRC

