docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org6728afa" class="outline-3">
<h3 id="org6728afa"><span class="section-number-3">6.2.</span> init-openai.el - Aider (DeepSeek)</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> aidermacs
  <span style="color: #30b3ff;">:bind</span> <span style="color: #c770ff;">(</span><span style="color: #1cc24b;">"C-c a"</span> . aidermacs-transient-menu<span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:custom</span>
  <span style="color: #c770ff;">(</span>aidermacs-default-model <span style="color: #1cc24b;">"deepseek"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-architect-model <span style="color: #1cc24b;">"deepseek/deepseek-reasoner"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-editor-model <span style="color: #1cc24b;">"deepseek/deepseek-chat"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-backend 'vterm<span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-watch-files t<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgc988516" class="outline-3">
<h3 id="orgc988516"><span class="section-number-3">6.3.</span> init-lsp.el - Language Server Protocol</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Eglot auto-starts for rust-mode and python-mode
</span><span style="color: #24f6d9;">(</span>add-hook 'rust-mode-hook 'eglot-ensure<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span>add-hook 'python-mode-hook 'eglot-ensure<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Copilot
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> copilot
  <span style="color: #30b3ff;">:vc</span> <span style="color: #c770ff;">(</span><span style="color: #30b3ff;">:url</span> <span style="color: #1cc24b;">"https://github.com/copilot-emacs/copilot.el"</span> <span style="color: #30b3ff;">:branch</span> <span style="color: #1cc24b;">"main"</span><span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:config</span>
  <span style="color: #c770ff;">(</span>global-copilot-mode<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org06f6009" class="outline-3">
<h3 id="org06f6009"><span class="section-number-3">6.4.</span> init-org.el - Org Mode</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Custom tags
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-tag-alist '<span style="color: #c770ff;">(</span><span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Research"</span> . ?r<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Literature"</span> . ?l<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Book"</span> . ?b<span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Babel languages
</span><span style="color: #24f6d9;">(</span>org-babel-do-load-languages 'org-babel-load-languages
  '<span style="color: #c770ff;">(</span><span style="color: #e6ff57;">(</span>emacs-lisp . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>ditaa . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>python . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>shell . t<span style="color: #e6ff57;">)</span>
    <span style="color: #e6ff57;">(</span>latex . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>plantuml . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>R . t<span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">PlantUML
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-plantuml-jar-path <span style="color: #1cc24b;">"~/.emacs.d/software/plantuml.jar"</span><span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-confirm-babel-evaluate nil<span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga460230" class="outline-3">
<h3 id="orga460230"><span class="section-number-3">6.5.</span> init-evil.el - Vim Emulation</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Evil escape
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq-default</span> evil-escape-delay 0.3<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq-default</span> evil-escape-key-sequence <span style="color: #1cc24b;">"kj"</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Undo-fu (improved undo)
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> undo-limit 8000000 undo-strong-limit 8000000 undo-outer-limit 8000000<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Evil surround (per-mode pairs)
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Shell: $ &#8594; $()
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Org: [ &#8594; [[]], = &#8594; ==
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Emacs-lisp: ( &#8594; ( ), ` &#8594; `'
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Generic: / &#8594; //</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org2f763e9" class="outline-3">
<h3 id="org2f763e9"><span class="section-number-3">6.6.</span> init-ui.el - Visual Configuration</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Theme
</span><span style="color: #24f6d9;">(</span>load-theme 'doom-dracula t<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Font
</span><span style="color: #24f6d9;">(</span>set-face-attribute 'default nil <span style="color: #30b3ff;">:font</span> <span style="color: #1cc24b;">"Maple Mono 17"</span> <span style="color: #30b3ff;">:weight</span> 'normal<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">CJK Font
</span><span style="color: #24f6d9;">(</span>set-fontset-font t 'han '<span style="color: #c770ff;">(</span><span style="color: #1cc24b;">"LXGW WenKai Mono"</span> . <span style="color: #1cc24b;">"&#24494;&#36719;&#38597;&#40657;"</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Hide UI elements
</span><span style="color: #24f6d9;">(</span>menu-bar-mode -1<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span>tool-bar-mode -1<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span>scroll-bar-mode -1<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Line numbers
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">when</span> <span style="color: #c770ff;">(</span>fboundp 'display-line-numbers-mode<span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>global-display-line-numbers-mode<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org27f0059" class="outline-3">
<h3 id="org27f0059"><span class="section-number-3">6.7.</span> init-python.el - Python Development</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Run scripts with nohup
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">defun</span> <span style="color: #24f6d9;">lz/running-current-bash-with-nohup</span> <span style="color: #c770ff;">()</span>
  <span style="color: #c770ff;">(</span><span style="color: #c770ff; font-weight: bold;">interactive</span><span style="color: #c770ff;">)</span>
  <span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Runs: nohup bash &lt;file&gt; &gt; timestamp-identify---runfile.log &amp;
</span>
<span style="color: #c770ff;">(</span><span style="color: #c770ff; font-weight: bold;">defun</span> <span style="color: #24f6d9;">lz/running-current-python-with-nohup</span> <span style="color: #e6ff57;">()</span>
  <span style="color: #e6ff57;">(</span><span style="color: #c770ff; font-weight: bold;">interactive</span><span style="color: #e6ff57;">)</span>
  <span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Prompts for conda env, then runs: nohup $python &lt;file&gt; &gt; ...
</span>
<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">GPU management
</span><span style="color: #e6ff57;">(</span><span style="color: #c770ff; font-weight: bold;">defun</span> <span style="color: #24f6d9;">lz/run-occupy-python</span> <span style="color: #30b3ff;">()</span>
  <span style="color: #30b3ff;">(</span><span style="color: #c770ff; font-weight: bold;">interactive</span><span style="color: #30b3ff;">)</span>
  <span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Occupy GPU device for testing
</span>
<span style="color: #30b3ff;">(</span><span style="color: #c770ff; font-weight: bold;">defun</span> <span style="color: #24f6d9;">lz/open-tensorboard-in-current-buffer</span> <span style="color: #ffa83d;">()</span>
  <span style="color: #ffa83d;">(</span><span style="color: #c770ff; font-weight: bold;">interactive</span><span style="color: #ffa83d;">)</span>
  <span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Open TensorBoard in project directory</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgf9b19e4" class="outline-3">
<h3 id="orgf9b19e4"><span class="section-number-3">6.8.</span> init-ssh.el - SSH Connections</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Direct connections
</span>ssh-connect-141    <span style="color: #8ca391;">; </span><span style="color: #8ca391; font-style: italic;">10.21.20.141
</span>ssh-connect-142    <span style="color: #8ca391;">; </span><span style="color: #8ca391; font-style: italic;">10.21.20.142
</span>ssh-connect-cs1    <span style="color: #8ca391;">; </span><span style="color: #8ca391; font-style: italic;">cs1.astaple.com
</span>ssh-connect-cs2    <span style="color: #8ca391;">; </span><span style="color: #8ca391; font-style: italic;">cs2.astaple.com
</span>ssh-connect-gs9-16 <span style="color: #8ca391;">; </span><span style="color: #8ca391; font-style: italic;">gsN.astaple.com
</span>
<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Via jump host (is1.astaple.com)
</span>ssh-connect-fromout-cs1-2
ssh-connect-fromout-gs9-16
</code></pre>
</div>
</div>
</div>
</div>
