orgs/My-Emacs-Configuration-2026.org
* Custom Functions

** Core Utilities (init-self-config-function.el)

| Function            | Description                                    |
|---------------------|------------------------------------------------|
| my/indent-4-space   | Indent/dedent region or insert 4 spaces        |
| Platform detection  | *is-mac*, *is-wsl*, *is-windows*, *is-linux*, *is-gui* |

** Python Scripts (init-python.el)

| Function                                   | Description                           |
|--------------------------------------------|---------------------------------------|
| lz/running-current-bash-with-nohup         | Run bash script with timestamped log  |
| lz/running-current-python-with-nohup       | Run Python with conda environment     |
| lz/nohup-switch-run                       | Auto-detect and run file              |
| lz/run-occupy-python                      | Occupy GPU device                     |
| lz/open-tensorboard-in-current-buffer     | Launch TensorBoard                    |
| lz/look-nvidia-state                      | Show GPU status                       |

** Buffer Management (init-buffer.el)

| Function           | Description                    |
|--------------------|--------------------------------|
| clean-all-buffers  | Kill all open buffers          |

** WSL Utilities (init-wsl.el)

| Function                                              | Description                        |
|-------------------------------------------------------|------------------------------------|
| wsl-copy-region-to-clipboard                          | Copy to Windows clipboard          |
| wsl-cut-region-to-clipboard                          | Cut to Windows clipboard           |
| my-yank-image-from-win-clipboard-through-powershell   | Paste image from Windows           |
| my-open-windows-downloads                            | Open Windows Downloads folder       |

** SSH Connections (init-ssh.el)

| Function               | Description                       |
|------------------------|-----------------------------------|
| ssh-connect-141/142    | Direct SSH to lab servers         |
| ssh-connect-cs1/2      | SSH to cs servers                 |
| ssh-connect-gs9-16     | SSH to gs servers                 |
| ssh-connect-fromout-*  | SSH via jump host                 |
| ssh-connect-vuln       | SSH to vuln server                |

** Org Mode (init-org.el)

| Function             | Description                     |
|----------------------|---------------------------------|
| fastinsert-org-head  | Insert org header template      |
| org-insert-src-block | Insert source code block        |
| my-screen-capture    | Screen capture to org           |
| open-org-note        | Open org note                   |
| open-worklog-in-d    | Open worklog                    |

** Blog Publishing (init-blog.el)

| Function                          | Description               |
|-----------------------------------|---------------------------|
| lz/org-publish-sitemap-with-time  | Custom sitemap generator   |

** LaTeX (init-latex.el)

| Function                    | Description                     |
|-----------------------------|---------------------------------|
| latex-cover-region-with@zl | Wrap region in LaTeX command    |

* Platform-Specific Features

** Windows (WSL)

- Clipboard integration via =clip.exe=
- Image paste from Windows clipboard
- Proxy configuration
- Git configuration

** macOS

- =exec-path-from-shell= for PATH management
- Native clipboard integration
- Application-open for external links

** Linux

- =vterm= for fast terminal
- =xsel= for clipboard (optional)
- Native file watchers

** WSL (Windows Subsystem for Linux)

- Windows PATH filtering (removes /mnt/c/ paths)
- Cross-platform clipboard functions
- GPU detection and management
- Jump host SSH connections

* Environment Variables

| Variable           | Description                          | Required          |
|-------------------|--------------------------------------|-------------------|
| OPENROUTER_API_KEY | API key for GPTEL/OpenRouter        | Yes (for AI)      |
| DEEPSEEK_API_KEY  | API key for DeepSeek (Aider)         | Yes (for Aider)   |
| LC_ALL            | Locale setting (=C.UTF-8=)           | No                |
| LANG              | Language setting (=C.UTF-8=)         | No                |
| DISPLAY           | X display for GUI features           | Auto-detected     |

* Custom Themes & Colors

** doom-dracula Theme

Mode line changes color based on Evil state:
- *Insert state*: Red background (#C53030)
- *Emacs state*: Green background (#2F855A)
- *Modified buffer*: Yellow background (#E9B44C)
- *Normal state*: Dark background (#000000) with green text (#68D391)

** Font Configuration

- *Default font*: Maple Mono 17 (Linux), JetBrainsMono 17 (fallback)
- *CJK font*: LXGW WenKai Mono / 微软雅黑
- *Mode line*: Maple Mono 12 italic

* Troubleshooting

