docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org5f3cf81" class="outline-2">
<h2 id="org5f3cf81"><span class="section-number-2">7.</span> Custom Functions</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd55fbfd" class="outline-3">
<h3 id="orgd55fbfd"><span class="section-number-3">7.1.</span> Core Utilities (init-self-config-function.el)</h3>
<div class="outline-text-3" id="text-7-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">my/indent-4-space</td>
<td class="org-left">Indent/dedent region or insert 4 spaces</td>
</tr>

<tr>
<td class="org-left">Platform detection</td>
<td class="org-left"><b>is-mac</b>, <b>is-wsl</b>, <b>is-windows</b>, <b>is-linux</b>, <b>is-gui</b></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb86ac3d" class="outline-3">
<h3 id="orgb86ac3d"><span class="section-number-3">7.2.</span> Python Scripts (init-python.el)</h3>
<div class="outline-text-3" id="text-7-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">lz/running-current-bash-with-nohup</td>
<td class="org-left">Run bash script with timestamped log</td>
</tr>

<tr>
<td class="org-left">lz/running-current-python-with-nohup</td>
<td class="org-left">Run Python with conda environment</td>
</tr>

<tr>
<td class="org-left">lz/nohup-switch-run</td>
<td class="org-left">Auto-detect and run file</td>
</tr>

<tr>
<td class="org-left">lz/run-occupy-python</td>
<td class="org-left">Occupy GPU device</td>
</tr>

<tr>
<td class="org-left">lz/open-tensorboard-in-current-buffer</td>
<td class="org-left">Launch TensorBoard</td>
</tr>

<tr>
<td class="org-left">lz/look-nvidia-state</td>
<td class="org-left">Show GPU status</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb275cd0" class="outline-3">
<h3 id="orgb275cd0"><span class="section-number-3">7.3.</span> Buffer Management (init-buffer.el)</h3>
<div class="outline-text-3" id="text-7-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">clean-all-buffers</td>
<td class="org-left">Kill all open buffers</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7b8c498" class="outline-3">
<h3 id="org7b8c498"><span class="section-number-3">7.4.</span> WSL Utilities (init-wsl.el)</h3>
<div class="outline-text-3" id="text-7-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">wsl-copy-region-to-clipboard</td>
<td class="org-left">Copy to Windows clipboard</td>
</tr>

<tr>
<td class="org-left">wsl-cut-region-to-clipboard</td>
<td class="org-left">Cut to Windows clipboard</td>
</tr>

<tr>
<td class="org-left">my-yank-image-from-win-clipboard-through-powershell</td>
<td class="org-left">Paste image from Windows</td>
</tr>

<tr>
<td class="org-left">my-open-windows-downloads</td>
<td class="org-left">Open Windows Downloads folder</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0bc515d" class="outline-3">
<h3 id="org0bc515d"><span class="section-number-3">7.5.</span> SSH Connections (init-ssh.el)</h3>
<div class="outline-text-3" id="text-7-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ssh-connect-141/142</td>
<td class="org-left">Direct SSH to lab servers</td>
</tr>

<tr>
<td class="org-left">ssh-connect-cs1/2</td>
<td class="org-left">SSH to cs servers</td>
</tr>

<tr>
<td class="org-left">ssh-connect-gs9-16</td>
<td class="org-left">SSH to gs servers</td>
</tr>

<tr>
<td class="org-left">ssh-connect-fromout-*</td>
<td class="org-left">SSH via jump host</td>
</tr>

<tr>
<td class="org-left">ssh-connect-vuln</td>
<td class="org-left">SSH to vuln server</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgef40441" class="outline-3">
<h3 id="orgef40441"><span class="section-number-3">7.6.</span> Org Mode (init-org.el)</h3>
<div class="outline-text-3" id="text-7-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">fastinsert-org-head</td>
<td class="org-left">Insert org header template</td>
</tr>

<tr>
<td class="org-left">org-insert-src-block</td>
<td class="org-left">Insert source code block</td>
</tr>

<tr>
<td class="org-left">my-screen-capture</td>
<td class="org-left">Screen capture to org</td>
</tr>

<tr>
<td class="org-left">open-org-note</td>
<td class="org-left">Open org note</td>
</tr>

<tr>
<td class="org-left">open-worklog-in-d</td>
<td class="org-left">Open worklog</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0259072" class="outline-3">
<h3 id="org0259072"><span class="section-number-3">7.7.</span> Blog Publishing (init-blog.el)</h3>
<div class="outline-text-3" id="text-7-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">lz/org-publish-sitemap-with-time</td>
<td class="org-left">Custom sitemap generator</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org36f5221" class="outline-3">
<h3 id="org36f5221"><span class="section-number-3">7.8.</span> LaTeX (init-latex.el)</h3>
<div class="outline-text-3" id="text-7-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">latex-cover-region-with@zl</td>
<td class="org-left">Wrap region in LaTeX command</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org0da2ad9" class="outline-2">
<h2 id="org0da2ad9"><span class="section-number-2">8.</span> Platform-Specific Features</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org0f02d5c" class="outline-3">
<h3 id="org0f02d5c"><span class="section-number-3">8.1.</span> Windows (WSL)</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Clipboard integration via <code>clip.exe</code></li>
<li>Image paste from Windows clipboard</li>
<li>Proxy configuration</li>
<li>Git configuration</li>
</ul>
</div>
</div>
<div id="outline-container-org8132ccb" class="outline-3">
<h3 id="org8132ccb"><span class="section-number-3">8.2.</span> macOS</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li><code>exec-path-from-shell</code> for PATH management</li>
<li>Native clipboard integration</li>
<li>Application-open for external links</li>
</ul>
</div>
</div>
<div id="outline-container-orgd612742" class="outline-3">
<h3 id="orgd612742"><span class="section-number-3">8.3.</span> Linux</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li><code>vterm</code> for fast terminal</li>
<li><code>xsel</code> for clipboard (optional)</li>
<li>Native file watchers</li>
</ul>
</div>
</div>
<div id="outline-container-org4dcfef2" class="outline-3">
<h3 id="org4dcfef2"><span class="section-number-3">8.4.</span> WSL (Windows Subsystem for Linux)</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>Windows PATH filtering (removes <i>mnt/c</i> paths)</li>
<li>Cross-platform clipboard functions</li>
<li>GPU detection and management</li>
<li>Jump host SSH connections</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org170102b" class="outline-2">
<h2 id="org170102b"><span class="section-number-2">9.</span> Environment Variables</h2>
<div class="outline-text-2" id="text-9">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Required</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OPENROUTER_API_KEY</td>
<td class="org-left">API key for GPTEL/OpenRouter</td>
<td class="org-left">Yes (for AI)</td>
</tr>

<tr>
<td class="org-left">DEEPSEEK_API_KEY</td>
<td class="org-left">API key for DeepSeek (Aider)</td>
<td class="org-left">Yes (for Aider)</td>
</tr>

<tr>
<td class="org-left">LC_ALL</td>
<td class="org-left">Locale setting (<code>C.UTF-8</code>)</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">LANG</td>
<td class="org-left">Language setting (<code>C.UTF-8</code>)</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">DISPLAY</td>
<td class="org-left">X display for GUI features</td>
<td class="org-left">Auto-detected</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb390c9c" class="outline-2">
<h2 id="orgb390c9c"><span class="section-number-2">10.</span> Custom Themes &amp; Colors</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org9f67f14" class="outline-3">
<h3 id="org9f67f14"><span class="section-number-3">10.1.</span> doom-dracula Theme</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Mode line changes color based on Evil state:
</p>
<ul class="org-ul">
<li><b>Insert state</b>: Red background (#C53030)</li>
<li><b>Emacs state</b>: Green background (#2F855A)</li>
<li><b>Modified buffer</b>: Yellow background (#E9B44C)</li>
<li><b>Normal state</b>: Dark background (#000000) with green text (#68D391)</li>
</ul>
</div>
</div>
<div id="outline-container-org412c5b5" class="outline-3">
<h3 id="org412c5b5"><span class="section-number-3">10.2.</span> Font Configuration</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li><b>Default font</b>: Maple Mono 17 (Linux), JetBrainsMono 17 (fallback)</li>
<li><b>CJK font</b>: LXGW WenKai Mono / 微软雅黑</li>
<li><b>Mode line</b>: Maple Mono 12 italic</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org674f5ce" class="outline-2">
<h2 id="org674f5ce"><span class="section-number-2">11.</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-11">
</div>
