orgs/My-Emacs-Configuration-2026.org
** Package Installation Fails

#+BEGIN_SRC bash
# Refresh package archives
M-x package-refresh-contents RET
#+END_SRC

** LSP Not Working

#+BEGIN_SRC bash
# Install pyright
pip install pyright

# Or for Rust
rustup component add rust-analyzer
#+END_SRC

** AI Features Not Working

#+BEGIN_SRC bash
# Check API key is set
echo $OPENROUTER_API_KEY

# If using Aider, check DeepSeek key
echo $DEEPSEEK_API_KEY
#+END_SRC

** SSH Connection Issues

#+BEGIN_SRC bash
# Test SSH connection manually
ssh zi@cs1.astaple.com

# Check tramp configuration
M-x tramp-version RET
#+END_SRC

** Performance Issues

#+BEGIN_SRC bash
# Increase garbage collection threshold (already configured)
# In init.el: (setq gc-cons-threshold (* 50 1024 1024))

# Check startup time
emacs --debug-init
#+END_SRC

* Acknowledgments

This configuration builds upon many excellent Emacs packages and ideas from:

- [[https://github.com/doomemacs/doomemacs][Doom Emacs]] - Theme and structure inspiration
- [[https://github.com/bbatsov/prelude][Prelude]] - General configuration patterns
- [[https://github.com/capitaomorte/sly][Sly]] - Common Lisp IDE ideas
- [[https://www.orgroam.com/][Org Roam]] - Knowledge management
- [[https://magit.vc/][Magit]] - Git interface
- [[https://github.com/manzaltu/claude-code-ide.el][Claude Code IDE]] - Claude integration

* 中文翻译

这是一份全面的、模块化的 Emacs 配置，集成了 AI/LLM 集成、Python 开发工具、用于笔记和发布的 Org-mode，以及通过 Evil 模式实现的 Vim 风格编辑。

** 安装与设置
*** 前置要求

- *Emacs* 27+ (推荐)
- *Git* 用于版本控制功能
- *Python* (推荐 anaconda3 或 miniconda3) 用于 Python 开发
- *PlantUML* (~/.emacs.d/software/plantuml.jar) 用于图表生成
- *RIPGrep* (rg) 用于 counsel-rg 搜索
- *Universal Ctags* 用于 Citre 代码导航

*** 安装

#+BEGIN_SRC bash
# 克隆配置
git clone https://github.com/ziLiang3845/.emacs.d.git ~/.emacs.d

# 安装所需外部工具
# - plantuml.jar (~/.emacs.d/software/plantuml.jar)
# - rg (ripgrep)
# - curl (用于 OpenRouter API)

# 设置环境变量 (参见环境变量部分)
export OPENROUTER_API_KEY="your-api-key"

# 启动 Emacs
emacs
#+END_SRC

*** 首次设置

1. 启动 Emacs - 包将会自动安装
2. 等待所有包安装完成 (首次启动可能需要 5-10 分钟)
3. 安装完成后重启 Emacs

*** 设置脚本 (doc/)

=doc/= 目录包含用于自动化安装系统依赖的 shell 脚本。在首次启动 Emacs 之前按顺序运行这些脚本。

**** Ubuntu/Debian 设置脚本

| 脚本                           | 描述                                                                                                              |
|------------------------------|------------------------------------------------------------------------------------------------------------------|
| =0.make_install_emacs29.sh=   | 从源码编译安装 Emacs 30.1 (需要构建工具)                                                                          |
| =2.run_ubuntu_shell_sudo.sh=  | 安装系统包：xclip, xsel, gdb, w3m, aspell, scrot, openjdk-17, graphviz, python3, pipenv, mplayer, socat, cmake, zsh, ripgrep, ag 以及开发库 |
| =3.gitclone.sh=              | 克隆额外的仓库 (用于可选功能)                                                                                     |
| =4.pip-install.sh=          | 安装 Python 包：python-lsp-server, torch, numpy, scikit-learn, matplotlib                                        |
| =5.add_fonts.sh=            | 安装 Maple Mono 和 CJK 字体 (文凯)                                                                               |
| =6.initial_setup.sh=        | 全局配置 git user.name 和 user.email                                                                             |
| =install-ctags.sh=         | 安装 universal-ctags 用于 Citre 代码导航                                                                        |

**** 推荐的安装顺序

#+BEGIN_SRC bash
cd ~/.emacs.d/doc/

# 1. 安装系统包 (Ubuntu/Debian)
sudo bash 2.run_ubuntu_shell_sudo.sh

# 2. 从源码安装 Emacs (如果不使用包管理器)
bash 0.make_install_emacs29.sh

# 3. 安装 ctags 用于代码导航
sudo bash install-ctags.sh

# 4. 安装字体
bash 5.add_fonts.sh

# 5. 安装 Python 包用于 LSP
bash 4.pip-install.sh

# 6. Git 配置
bash 6.initial_setup.sh
#+END_SRC

**** Arch Linux

| 脚本                           | 描述                   |
|------------------------------|-----------------------|
| =2.1.run_install_arch_pacman.sh=  | 通过 pacman 安装包    |
| =5.1.add_fonts_arch_pacman.sh=   | 在 Arch 上安装字体    |

**** 其他设置文件

| 文件                                    | 描述                              |
|---------------------------------------|----------------------------------|
| =hope.org=                              | TODO 跟踪和愿望清单               |
| =howToGetCapture.org=                   | 截图设置指南                       |
| =spellcheck.org=                        | 拼写检查配置                       |
| =WSL2-ubuntu-install-config-emacs.org= | WSL2 特定的 Emacs 安装指南         |
| =install_emacs_without_sudo.txt=        | 无 sudo 构建 Emacs 的笔记          |
| =latex环境指南.doc=                      | LaTeX 环境设置指南 (中文)          |

