docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org35d7955" class="outline-3">
<h3 id="org35d7955"><span class="section-number-3">11.1.</span> Package Installation Fails</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Refresh package archives
</span>M-x package-refresh-contents RET
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7e03761" class="outline-3">
<h3 id="org7e03761"><span class="section-number-3">11.2.</span> LSP Not Working</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Install pyright
</span>pip install pyright

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Or for Rust
</span>rustup component add rust-analyzer
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org9dfa182" class="outline-3">
<h3 id="org9dfa182"><span class="section-number-3">11.3.</span> AI Features Not Working</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Check API key is set
</span><span style="color: #30b3ff;">echo</span> $<span style="color: #62ff94;">OPENROUTER_API_KEY</span>

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">If using Aider, check DeepSeek key
</span><span style="color: #30b3ff;">echo</span> $<span style="color: #62ff94;">DEEPSEEK_API_KEY</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3b26dc6" class="outline-3">
<h3 id="org3b26dc6"><span class="section-number-3">11.4.</span> SSH Connection Issues</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Test SSH connection manually
</span>ssh zi@cs1.astaple.com

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Check tramp configuration
</span>M-x tramp-version RET
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgbd8dbd0" class="outline-3">
<h3 id="orgbd8dbd0"><span class="section-number-3">11.5.</span> Performance Issues</h3>
<div class="outline-text-3" id="text-11-5">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Increase garbage collection threshold (already configured)
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">In init.el: (setq gc-cons-threshold (* 50 1024 1024))
</span>
<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">Check startup time
</span>emacs --debug-init
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3659e2c" class="outline-2">
<h2 id="org3659e2c"><span class="section-number-2">12.</span> Acknowledgments</h2>
<div class="outline-text-2" id="text-12">
<p>
This configuration builds upon many excellent Emacs packages and ideas from:
</p>

<ul class="org-ul">
<li><a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a> - Theme and structure inspiration</li>
<li><a href="https://github.com/bbatsov/prelude">Prelude</a> - General configuration patterns</li>
<li><a href="https://github.com/capitaomorte/sly">Sly</a> - Common Lisp IDE ideas</li>
<li><a href="https://www.orgroam.com/">Org Roam</a> - Knowledge management</li>
<li><a href="https://magit.vc/">Magit</a> - Git interface</li>
<li><a href="https://github.com/manzaltu/claude-code-ide.el">Claude Code IDE</a> - Claude integration</li>
</ul>
</div>
</div>
<div id="outline-container-org902d0c7" class="outline-2">
<h2 id="org902d0c7"><span class="section-number-2">13.</span> 中文翻译</h2>
<div class="outline-text-2" id="text-13">
<p>
这是一份全面的、模块化的 Emacs 配置，集成了 AI/LLM 集成、Python 开发工具、用于笔记和发布的 Org-mode，以及通过 Evil 模式实现的 Vim 风格编辑。
</p>
</div>
<div id="outline-container-org4e73e30" class="outline-3">
<h3 id="org4e73e30"><span class="section-number-3">13.1.</span> 安装与设置</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgf91a1bf" class="outline-4">
<h4 id="orgf91a1bf"><span class="section-number-4">13.1.1.</span> 前置要求</h4>
<div class="outline-text-4" id="text-13-1-1">
<ul class="org-ul">
<li><b>Emacs</b> 27+ (推荐)</li>
<li><b>Git</b> 用于版本控制功能</li>
<li><b>Python</b> (推荐 anaconda3 或 miniconda3) 用于 Python 开发</li>
<li><b>PlantUML</b> (~/.emacs.d/software/plantuml.jar) 用于图表生成</li>
<li><b>RIPGrep</b> (rg) 用于 counsel-rg 搜索</li>
<li><b>Universal Ctags</b> 用于 Citre 代码导航</li>
</ul>
</div>
</div>
<div id="outline-container-org83426b3" class="outline-4">
<h4 id="org83426b3"><span class="section-number-4">13.1.2.</span> 安装</h4>
<div class="outline-text-4" id="text-13-1-2">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">&#20811;&#38534;&#37197;&#32622;
</span>git clone https://github.com/ziLiang3845/.emacs.d.git ~/.emacs.d

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">&#23433;&#35013;&#25152;&#38656;&#22806;&#37096;&#24037;&#20855;
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- plantuml.jar (~/.emacs.d/software/plantuml.jar)
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- rg (ripgrep)
</span><span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">- curl (&#29992;&#20110; OpenRouter API)
</span>
<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">&#35774;&#32622;&#29615;&#22659;&#21464;&#37327; (&#21442;&#35265;&#29615;&#22659;&#21464;&#37327;&#37096;&#20998;)
</span><span style="color: #30b3ff;">export</span> <span style="color: #62ff94;">OPENROUTER_API_KEY</span>=<span style="color: #1cc24b;">"your-api-key"</span>

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">&#21551;&#21160; Emacs
</span>emacs
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgbffb936" class="outline-4">
<h4 id="orgbffb936"><span class="section-number-4">13.1.3.</span> 首次设置</h4>
<div class="outline-text-4" id="text-13-1-3">
<ol class="org-ol">
<li>启动 Emacs - 包将会自动安装</li>
<li>等待所有包安装完成 (首次启动可能需要 5-10 分钟)</li>
<li>安装完成后重启 Emacs</li>
</ol>
</div>
</div>
<div id="outline-container-org044ae06" class="outline-4">
<h4 id="org044ae06"><span class="section-number-4">13.1.4.</span> 设置脚本 (doc/)</h4>
<div class="outline-text-4" id="text-13-1-4">
<p>
<code>doc/</code> 目录包含用于自动化安装系统依赖的 shell 脚本。在首次启动 Emacs 之前按顺序运行这些脚本。
</p>
</div>
<ol class="org-ol">
<li><a id="orgb4b57d5"></a>Ubuntu/Debian 设置脚本<br>
<div class="outline-text-5" id="text-13-1-4-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">脚本</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>0.make_install_emacs29.sh</code></td>
<td class="org-left">从源码编译安装 Emacs 30.1 (需要构建工具)</td>
</tr>

<tr>
<td class="org-left"><code>2.run_ubuntu_shell_sudo.sh</code></td>
<td class="org-left">安装系统包：xclip, xsel, gdb, w3m, aspell, scrot, openjdk-17, graphviz, python3, pipenv, mplayer, socat, cmake, zsh, ripgrep, ag 以及开发库</td>
</tr>

<tr>
<td class="org-left"><code>3.gitclone.sh</code></td>
<td class="org-left">克隆额外的仓库 (用于可选功能)</td>
</tr>

<tr>
<td class="org-left"><code>4.pip-install.sh</code></td>
<td class="org-left">安装 Python 包：python-lsp-server, torch, numpy, scikit-learn, matplotlib</td>
</tr>

<tr>
<td class="org-left"><code>5.add_fonts.sh</code></td>
<td class="org-left">安装 Maple Mono 和 CJK 字体 (文凯)</td>
</tr>

<tr>
<td class="org-left"><code>6.initial_setup.sh</code></td>
<td class="org-left">全局配置 git user.name 和 user.email</td>
</tr>

<tr>
<td class="org-left"><code>install-ctags.sh</code></td>
<td class="org-left">安装 universal-ctags 用于 Citre 代码导航</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgdd6eb87"></a>推荐的安装顺序<br>
<div class="outline-text-5" id="text-13-1-4-2">
<div class="org-src-container">
<pre class="src src-bash"><code><span style="color: #30b3ff;">cd</span> ~/.emacs.d/doc/

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">1. &#23433;&#35013;&#31995;&#32479;&#21253; (Ubuntu/Debian)
</span>sudo bash 2.run_ubuntu_shell_sudo.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">2. &#20174;&#28304;&#30721;&#23433;&#35013; Emacs (&#22914;&#26524;&#19981;&#20351;&#29992;&#21253;&#31649;&#29702;&#22120;)
</span>bash 0.make_install_emacs29.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">3. &#23433;&#35013; ctags &#29992;&#20110;&#20195;&#30721;&#23548;&#33322;
</span>sudo bash install-ctags.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">4. &#23433;&#35013;&#23383;&#20307;
</span>bash 5.add_fonts.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">5. &#23433;&#35013; Python &#21253;&#29992;&#20110; LSP
</span>bash 4.pip-install.sh

<span style="color: #8ca391;"># </span><span style="color: #8ca391; font-style: italic;">6. Git &#37197;&#32622;
</span>bash 6.initial_setup.sh
</code></pre>
</div>
</div>
</li>
<li><a id="orgeb85c0d"></a>Arch Linux<br>
<div class="outline-text-5" id="text-13-1-4-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">脚本</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>2.1.run_install_arch_pacman.sh</code></td>
<td class="org-left">通过 pacman 安装包</td>
</tr>

<tr>
<td class="org-left"><code>5.1.add_fonts_arch_pacman.sh</code></td>
<td class="org-left">在 Arch 上安装字体</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org548adef"></a>其他设置文件<br>
<div class="outline-text-5" id="text-13-1-4-4">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文件</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>hope.org</code></td>
<td class="org-left">TODO 跟踪和愿望清单</td>
</tr>

<tr>
<td class="org-left"><code>howToGetCapture.org</code></td>
<td class="org-left">截图设置指南</td>
</tr>

<tr>
<td class="org-left"><code>spellcheck.org</code></td>
<td class="org-left">拼写检查配置</td>
</tr>

<tr>
<td class="org-left"><code>WSL2-ubuntu-install-config-emacs.org</code></td>
<td class="org-left">WSL2 特定的 Emacs 安装指南</td>
</tr>

<tr>
<td class="org-left"><code>install_emacs_without_sudo.txt</code></td>
<td class="org-left">无 sudo 构建 Emacs 的笔记</td>
</tr>

<tr>
<td class="org-left"><code>latex环境指南.doc</code></td>
<td class="org-left">LaTeX 环境设置指南 (中文)</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
