docs/My-Emacs-Configuration-2026.html
<div id="outline-container-org6dc9f63" class="outline-3">
<h3 id="org6dc9f63"><span class="section-number-3">13.2.</span> 项目结构</h3>
<div class="outline-text-3" id="text-13-2">
<pre class="example" id="org5b0ad6a">
.emacs.d/
├── init.el                    # 主入口点
├── lisp/
│   ├── init-*.el            # 功能模块 (~50 个文件)
│   ├── custom.el            # Emacs Customize 设置
│   ├── my-*.el              # 自定义辅助函数
│   └── org-*.el             # Org-mode 扩展
├── doc/                      # 系统依赖的设置脚本
├── other-files/              # 额外资源
└── feeds/                    # RSS 订阅配置 (elfeed)
</pre>
</div>
<div id="outline-container-orge77a6a1" class="outline-4">
<h4 id="orge77a6a1"><span class="section-number-4">13.2.1.</span> 模块加载顺序 (init.el)</h4>
<div class="outline-text-4" id="text-13-2-1">
<ul class="org-ul">
<li>init-self-config-function  → 平台检测，核心工具</li>
<li>init-wsl                   → WSL 工具</li>
<li>init-elpa                  → 包管理</li>
<li>init-openai               → Aider (DeepSeek AI 编程助手)</li>
<li>init-eshell               → Shell 配置</li>
<li>init-proxy                → 代理设置</li>
<li>init-largefile            → 大文件处理</li>
<li>init-dired                → 文件管理器</li>
<li>init-clipboard            → 剪贴板集成</li>
<li>init-yas                  → 代码片段</li>
<li>init-git                  → Git gutter</li>
<li>init-citre                → 基于标签的代码导航</li>
<li>init-python               → Python 开发</li>
<li>init-latex                → LaTeX 编辑</li>
<li>init-cl                   → Common Lisp</li>
<li>init-cpp                  → C++ (已禁用)</li>
<li>init-rust                 → Rust 开发</li>
<li>init-cider                → Clojure REPL</li>
<li>init-blog                 → Org 发布</li>
<li>init-web                  → Web 开发</li>
<li>init-path                 → PATH 配置</li>
<li>init-rss                  → RSS 阅读器 (elfeed)</li>
<li>init-keybindings          → 全局快捷键</li>
<li>init-rg                   → Ripgrep 集成</li>
<li>init-spell                → 拼写检查</li>
<li>init-packages             → 包初始化</li>
<li>init-lsp                  → 语言服务器协议</li>
<li>init-evil                 → Vim 模拟</li>
<li>init-undo                 → 撤销配置</li>
<li>init-keyfreq              → 按键频率跟踪</li>
<li>init-org                  → Org-mode 配置</li>
<li>init-ssh                  → SSH 连接</li>
<li>init-ai                   → AI/LLM 集成 (gptel, claude-code-ide)</li>
<li>init-modeline             → Mode line 配置</li>
<li>init-window               → 窗口管理 (winum)</li>
<li>init-chinese              → 中文字体支持</li>
<li>init-better-defaults      → 改进的默认设置</li>
<li>init-ui                   → 视觉主题和样式</li>
<li>org-ui.el                 → Org 特定的 UI</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6a3f7dc" class="outline-3">
<h3 id="org6a3f7dc"><span class="section-number-3">13.3.</span> 核心功能概览</h3>
<div class="outline-text-3" id="text-13-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">AI/LLM 集成</td>
<td class="org-left">GPTEL (OpenRouter), Claude Code IDE, Aider (DeepSeek)</td>
</tr>

<tr>
<td class="org-left">Python 开发</td>
<td class="org-left">LSP (eglot), anaconda-mode, python-black, conda 集成</td>
</tr>

<tr>
<td class="org-left">Org Mode</td>
<td class="org-left">笔记, 发布, 文学编程, Babel</td>
</tr>

<tr>
<td class="org-left">Vim 模拟</td>
<td class="org-left">Evil 模式与自定义 leader 键</td>
</tr>

<tr>
<td class="org-left">代码导航</td>
<td class="org-left">Citre (ctags), xref, highlight-symbol</td>
</tr>

<tr>
<td class="org-left">生产力工具</td>
<td class="org-left">Yasnippet, smartparens, rainbow-delimiters</td>
</tr>

<tr>
<td class="org-left">Shell 集成</td>
<td class="org-left">vterm, eshell, SSH via tramp</td>
</tr>

<tr>
<td class="org-left">UI/主题</td>
<td class="org-left">doom-dracula 主题, doom-modeline, marginalia</td>
</tr>

<tr>
<td class="org-left">版本控制</td>
<td class="org-left">git-gutter, magit</td>
</tr>

<tr>
<td class="org-left">Web 开发</td>
<td class="org-left">web-mode, js2-mode, emmet-mode</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdcaab48" class="outline-3">
<h3 id="orgdcaab48"><span class="section-number-3">13.4.</span> 快捷键参考</h3>
<div class="outline-text-3" id="text-13-4">
</div>
<div id="outline-container-org6d77e3a" class="outline-4">
<h4 id="org6d77e3a"><span class="section-number-4">13.4.1.</span> 全局快捷键</h4>
<div class="outline-text-4" id="text-13-4-1">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-\</td>
<td class="org-left">comment-line</td>
<td class="org-left">注释/取消注释当前行</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">mwim-beginning-of-code-or-line</td>
<td class="org-left">跳转到代码/行首</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">mwim-end-of-code-or-line</td>
<td class="org-left">跳转到代码/行尾</td>
</tr>

<tr>
<td class="org-left">C-s</td>
<td class="org-left">swiper</td>
<td class="org-left">带候选项的增量搜索</td>
</tr>

<tr>
<td class="org-left">C-f5</td>
<td class="org-left">lz/nohup-switch-run</td>
<td class="org-left">运行当前文件 (自动检测 bash/python)</td>
</tr>

<tr>
<td class="org-left">F1</td>
<td class="org-left">restart-emacs</td>
<td class="org-left">重启 Emacs</td>
</tr>

<tr>
<td class="org-left">F2</td>
<td class="org-left">open-my-init-file</td>
<td class="org-left">打开 init.el</td>
</tr>

<tr>
<td class="org-left">TAB</td>
<td class="org-left">my/indent-4-space</td>
<td class="org-left">缩进区域或插入 4 个空格</td>
</tr>

<tr>
<td class="org-left">S-TAB</td>
<td class="org-left">my/indent-4-space (带参数)</td>
<td class="org-left">取消缩进或删除 4 个空格</td>
</tr>

<tr>
<td class="org-left">M-0</td>
<td class="org-left">next-multiframe-window</td>
<td class="org-left">切换到下一个窗口</td>
</tr>

<tr>
<td class="org-left">M-9</td>
<td class="org-left">previous-multiframe-window</td>
<td class="org-left">切换到上一个窗口</td>
</tr>

<tr>
<td class="org-left">M-r</td>
<td class="org-left">query-replace</td>
<td class="org-left">查找和替换</td>
</tr>

<tr>
<td class="org-left">M-s</td>
<td class="org-left">counsel-rg</td>
<td class="org-left">Ripgrep 搜索</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">ibuffer</td>
<td class="org-left">Buffer 管理器</td>
</tr>

<tr>
<td class="org-left">C-x 4 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">分屏为 4 个水平窗口</td>
</tr>

<tr>
<td class="org-left">C-x 5 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">分屏为 3 个水平窗口</td>
</tr>

<tr>
<td class="org-left">C-x 6 &lt;num&gt;</td>
<td class="org-left">-</td>
<td class="org-left">分屏为 5 个混合窗口</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge83c9dd" class="outline-4">
<h4 id="orge83c9dd"><span class="section-number-4">13.4.2.</span> Evil 模式 Leader 键 (SPC)</h4>
<div class="outline-text-4" id="text-13-4-2">
<p>
以下所有快捷键在 Evil Normal/Visual 模式下以 <code>SPC</code> 为前缀。
</p>
</div>
<ol class="org-ol">
