orgs/My-Emacs-Configuration-2026.org
*** init-ai.el - AI/LLM 集成

#+BEGIN_SRC elisp
;; GPTEL (OpenRouter)
(setq gptel-model "qwen/qwen3.6-plus-preview:free")
(setq gptel-backend
      (gptel-make-openai "OpenRouter"
        :host "openrouter.ai"
        :endpoint "/api/v1/chat/completions"
        :stream t
        :key (lambda () (getenv "OPENROUTER_API_KEY"))))

;; Claude Code IDE
(use-package claude-code-ide
  :vc (:url "https://github.com/manzaltu/claude-code-ide.el" :rev :newest)
  :bind ("C-c C-'" . claude-code-ide-menu)
  :config
  (claude-code-ide-emacs-tools-setup))
#+END_SRC

*** init-openai.el - Aider (DeepSeek)

#+BEGIN_SRC elisp
(use-package aidermacs
  :bind ("C-c a" . aidermacs-transient-menu)
  :custom
  (aidermacs-default-model "deepseek")
  (aidermacs-architect-model "deepseek/deepseek-reasoner")
  (aidermacs-editor-model "deepseek/deepseek-chat")
  (aidermacs-backend 'vterm)
  (aidermacs-watch-files t))
#+END_SRC

*** init-lsp.el - 语言服务器协议

#+BEGIN_SRC elisp
;; Eglot 自动为 rust-mode 和 python-mode 启动
(add-hook 'rust-mode-hook 'eglot-ensure)
(add-hook 'python-mode-hook 'eglot-ensure)

;; Copilot
(use-package copilot
  :vc (:url "https://github.com/copilot-emacs/copilot.el" :branch "main")
  :config
  (global-copilot-mode))
#+END_SRC

*** init-org.el - Org Mode

#+BEGIN_SRC elisp
;; 自定义标签
(setq org-tag-alist '(("@Research" . ?r) ("@Literature" . ?l) ("@Book" . ?b)))

;; Babel 语言
(org-babel-do-load-languages 'org-babel-load-languages
  '((emacs-lisp . t) (ditaa . t) (python . t) (shell . t)
    (latex . t) (plantuml . t) (R . t)))

;; PlantUML
(setq org-plantuml-jar-path "~/.emacs.d/software/plantuml.jar")
(setq org-confirm-babel-evaluate nil)
#+END_SRC

*** init-evil.el - Vim 模拟

#+BEGIN_SRC elisp
;; Evil 转义
(setq-default evil-escape-delay 0.3)
(setq-default evil-escape-key-sequence "kj")

;; Undo-fu (改进的撤销)
(setq undo-limit 8000000 undo-strong-limit 8000000 undo-outer-limit 8000000)

;; Evil surround (每模式配对)
;; Shell: $ → $()
;; Org: [ → [[]], = → ==
;; Emacs-lisp: ( → ( ), ` → `'
;; 通用: / → //
#+END_SRC

*** init-ui.el - 视觉配置

#+BEGIN_SRC elisp
;; 主题
(load-theme 'doom-dracula t)

;; 字体
(set-face-attribute 'default nil :font "Maple Mono 17" :weight 'normal)

;; CJK 字体
(set-fontset-font t 'han '("LXGW WenKai Mono" . "微软雅黑"))

;; 隐藏 UI 元素
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; 行号
(when (fboundp 'display-line-numbers-mode)
  (global-display-line-numbers-mode))
#+END_SRC

