docs/My-Emacs-Configuration-2026.html
<div id="outline-container-orgee5f940" class="outline-3">
<h3 id="orgee5f940"><span class="section-number-3">13.6.</span> 配置文件</h3>
<div class="outline-text-3" id="text-13-6">
</div>
<div id="outline-container-orga3ba2e1" class="outline-4">
<h4 id="orga3ba2e1"><span class="section-number-4">13.6.1.</span> init-ai.el - AI/LLM 集成</h4>
<div class="outline-text-4" id="text-13-6-1">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">GPTEL (OpenRouter)
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> gptel-model <span style="color: #1cc24b;">"qwen/qwen3.6-plus-preview:free"</span><span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> gptel-backend
      <span style="color: #c770ff;">(</span>gptel-make-openai <span style="color: #1cc24b;">"OpenRouter"</span>
        <span style="color: #30b3ff;">:host</span> <span style="color: #1cc24b;">"openrouter.ai"</span>
        <span style="color: #30b3ff;">:endpoint</span> <span style="color: #1cc24b;">"/api/v1/chat/completions"</span>
        <span style="color: #30b3ff;">:stream</span> t
        <span style="color: #30b3ff;">:key</span> <span style="color: #e6ff57;">(</span><span style="color: #c770ff; font-weight: bold;">lambda</span> <span style="color: #30b3ff;">()</span> <span style="color: #30b3ff;">(</span>getenv <span style="color: #1cc24b;">"OPENROUTER_API_KEY"</span><span style="color: #30b3ff;">)</span><span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Claude Code IDE
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> claude-code-ide
  <span style="color: #30b3ff;">:vc</span> <span style="color: #c770ff;">(</span><span style="color: #30b3ff;">:url</span> <span style="color: #1cc24b;">"https://github.com/manzaltu/claude-code-ide.el"</span> <span style="color: #30b3ff;">:rev</span> <span style="color: #30b3ff;">:newest</span><span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:bind</span> <span style="color: #c770ff;">(</span><span style="color: #1cc24b;">"C-c C-'"</span> . claude-code-ide-menu<span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:config</span>
  <span style="color: #c770ff;">(</span>claude-code-ide-emacs-tools-setup<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgc99e9b2" class="outline-4">
<h4 id="orgc99e9b2"><span class="section-number-4">13.6.2.</span> init-openai.el - Aider (DeepSeek)</h4>
<div class="outline-text-4" id="text-13-6-2">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> aidermacs
  <span style="color: #30b3ff;">:bind</span> <span style="color: #c770ff;">(</span><span style="color: #1cc24b;">"C-c a"</span> . aidermacs-transient-menu<span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:custom</span>
  <span style="color: #c770ff;">(</span>aidermacs-default-model <span style="color: #1cc24b;">"deepseek"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-architect-model <span style="color: #1cc24b;">"deepseek/deepseek-reasoner"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-editor-model <span style="color: #1cc24b;">"deepseek/deepseek-chat"</span><span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-backend 'vterm<span style="color: #c770ff;">)</span>
  <span style="color: #c770ff;">(</span>aidermacs-watch-files t<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org04b5a66" class="outline-4">
<h4 id="org04b5a66"><span class="section-number-4">13.6.3.</span> init-lsp.el - 语言服务器协议</h4>
<div class="outline-text-4" id="text-13-6-3">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Eglot &#33258;&#21160;&#20026; rust-mode &#21644; python-mode &#21551;&#21160;
</span><span style="color: #24f6d9;">(</span>add-hook 'rust-mode-hook 'eglot-ensure<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span>add-hook 'python-mode-hook 'eglot-ensure<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Copilot
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">use-package</span> copilot
  <span style="color: #30b3ff;">:vc</span> <span style="color: #c770ff;">(</span><span style="color: #30b3ff;">:url</span> <span style="color: #1cc24b;">"https://github.com/copilot-emacs/copilot.el"</span> <span style="color: #30b3ff;">:branch</span> <span style="color: #1cc24b;">"main"</span><span style="color: #c770ff;">)</span>
  <span style="color: #30b3ff;">:config</span>
  <span style="color: #c770ff;">(</span>global-copilot-mode<span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org6f272ff" class="outline-4">
<h4 id="org6f272ff"><span class="section-number-4">13.6.4.</span> init-org.el - Org Mode</h4>
<div class="outline-text-4" id="text-13-6-4">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">&#33258;&#23450;&#20041;&#26631;&#31614;
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-tag-alist '<span style="color: #c770ff;">(</span><span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Research"</span> . ?r<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Literature"</span> . ?l<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span><span style="color: #1cc24b;">"@Book"</span> . ?b<span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Babel &#35821;&#35328;
</span><span style="color: #24f6d9;">(</span>org-babel-do-load-languages 'org-babel-load-languages
  '<span style="color: #c770ff;">(</span><span style="color: #e6ff57;">(</span>emacs-lisp . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>ditaa . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>python . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>shell . t<span style="color: #e6ff57;">)</span>
    <span style="color: #e6ff57;">(</span>latex . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>plantuml . t<span style="color: #e6ff57;">)</span> <span style="color: #e6ff57;">(</span>R . t<span style="color: #e6ff57;">)</span><span style="color: #c770ff;">)</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">PlantUML
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-plantuml-jar-path <span style="color: #1cc24b;">"~/.emacs.d/software/plantuml.jar"</span><span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> org-confirm-babel-evaluate nil<span style="color: #24f6d9;">)</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga6bc8cd" class="outline-4">
<h4 id="orga6bc8cd"><span class="section-number-4">13.6.5.</span> init-evil.el - Vim 模拟</h4>
<div class="outline-text-4" id="text-13-6-5">
<div class="org-src-container">
<pre class="src src-elisp"><code><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Evil &#36716;&#20041;
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq-default</span> evil-escape-delay 0.3<span style="color: #24f6d9;">)</span>
<span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq-default</span> evil-escape-key-sequence <span style="color: #1cc24b;">"kj"</span><span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Undo-fu (&#25913;&#36827;&#30340;&#25764;&#38144;)
</span><span style="color: #24f6d9;">(</span><span style="color: #c770ff; font-weight: bold;">setq</span> undo-limit 8000000 undo-strong-limit 8000000 undo-outer-limit 8000000<span style="color: #24f6d9;">)</span>

<span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Evil surround (&#27599;&#27169;&#24335;&#37197;&#23545;)
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Shell: $ &#8594; $()
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Org: [ &#8594; [[]], = &#8594; ==
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">Emacs-lisp: ( &#8594; ( ), ` &#8594; `'
</span><span style="color: #8ca391;">;; </span><span style="color: #8ca391; font-style: italic;">&#36890;&#29992;: / &#8594; //</span>
</code></pre>
</div>
</div>
</div>
